<?php
// php cleaning_v6.php

require_once('../support/_require_once.php');

//$file = file_get_contents('cleaning/v.6-h.txt');
$file = file_get_contents('cleaning/v.7_p.txt');

$lines = explode("\n", $file);

$count = count($lines);

$resultText = '';
$resultTextS = '';
$resultTextH = '';

$sample = 25;

$counter = 0;

for ($i = 0; $i < $count+1; $i++) {

    $lineR = replacer($lines[$i]);

    $resultText .= $lineR . "\n";

    if (0 == $i % 1000) {
        echo $i.'.';
    }
}

echo date('H:i:s');

file_put_contents('cleaning/v.7_p.txt', $resultText);
//file_put_contents('cleaning/v.7-s.txt', $resultTextS);
//file_put_contents('cleaning/v.7-h.txt', $resultTextH);

function replacer($line)
{
//    $line = str_ireplace(
//        ['  '],
//        [' ']
//        ,$line
//    );
//
//    $line = str_ireplace(
//        ['  '],
//        [' ']
//        ,$line
//    );
//
//    $line = str_ireplace(
//        ['  '],
//        [' ']
//        ,$line
//    );
//    $line = str_ireplace(
//        [' межд. ', ' (межд.) ', ' межд.–', '(междом.)', ' междом. ', ' междом.)', ' междом.:'],
//        [' *вигук* ', ' (*вигук*) ', ' *вигук*-', '(*вигук*)', ' *вигук* ', ' *вигук*)' , ' *вигук*']
//        ,$line
//    );
//
//    $line = str_ireplace(
//        [' мест. ', ' мест.)', '(мест. ', ' мест.,', ' мест.:', '(мест.)'],
//        [' *займенник* ', ' *займенник*)', '(*займенник* ', ' *займенник*,', ' *займенник*:', '(*займенник*)']
//        ,$line
//    );
//
//    $line = str_ireplace(
//        [' сз. ',],
//        [' *сполучник* ',]
//        ,$line
//    );
//
//    $line = str_ireplace(
//        ['(АД.)', '(АД)', '(АД. ', '(АД '],
//        ['(*Б. Антоненко-Давидович*)', '(*Б. Антоненко-Давидович*)', '(*Б. Антоненко-Давидович* ', '(*Б. Антоненко-Давидович* ']
//        ,$line
//    );
//
//    $line = str_ireplace(
//        ['(Азб. комун.)', '(А. Любч.)', ' Ант.Давид.)', '(Б. Антон.-Давид.)', 'Безвірник 1930'],
//        ['(*Азбука комунізма*)', '(*Аркадій Любченко*)', ' *Антоненко-Давидови*ч)', '(*Антоненко-Давидови*ч)', '*Безвірник 1930*']
//        ,$line
//    );
//
//    $line = str_ireplace(
//        ['(Ант.-Драг.)', '(Ант.-Драг. ', '(Аф.-Чужб.-Шевч.)', '(Бажан)', '(Балтщ.)'],
//        ['(*Антоновичъ и Драгомановъ*)', '(*Антоновичъ и Драгомановъ* ', '(*Афанасьевъ Воспоминания о Шевченкѣ*)', '(*Бажан*)', '(*Балтщина*)']
//        ,$line
//    );
//
//    $line = str_ireplace(
//        ['(Бердич. ', '(Бердич.)', '(Бердянщ.)', 'Бібл.', 'Біл.-Нос.', 'Б.-Нос.'],
//        ['(*Бердичівщина* ', '(*Бердичівщина*)', '(*Бердянщина*)', '*Біблійний*', '*Білецький-Носенко*', '*Білецький-Носенко*']
//        ,$line
//    );
//
//    $line = str_ireplace(
//        ['Бонд. виробн.', 'Борз.', 'Борзенщ.', '(Боров.)', '(Боровик.)'],
//        ['*Бондарне виробництво*', '*Борзенщина*', '*Борзенщина*', '(*Боровиковський*)', '(*Боровиковський*)']
//        ,$line
//    );
//
//    $line = str_ireplace(
//        ['(Браун.)', '(Брацл.)', '(Брацлавщ.)', '(Буков.)', '«Буков.»'],
//        ['(*Браунер*)', '(*Брацлавщина*)', '(*Брацлавщина*)', '(*Буковина*)', '«*Буковина*»']
//        ,$line
//    );
//
//    $line = str_ireplace(
//        ['(Балк.)', '(Вас.)', '(Васильківщ.)', '(Васильч.)', '(В. Гжицьк.)', ' Васильч.)'],
//        ['(*Балківщина*)', '(*Б_Василенко*)', '(*Васильківщина*)', '(*Васильченко*)', '(*Гжицьк*)', ' *Васильченко*)']
//        ,$line
//    );
//
//    $line = str_ireplace(
//        ['(Верхнедн.)', '(Верхр.)', 'Вес. пісня', '(Вин.)', '(Винн.)', '(Виннич.)', '(Верхнедн.', '(Верхр.,'],
//        ['(*Верхнедніпрівщина*)', '(*Верхратський*)', '*весільна пісня*', '(*Винниченко*)', '(*Винниченко*)', '(*Винниченко*)', '(*Верхнедніпрівщина* ', '(*Верхратський*,',]
//        ,$line
//    );
//
//    $line = str_ireplace(
//        ['Віннич.', '«Вісті»', '(Влизько)', 'Вовч.', 'Вовчанщ.', 'Волч.', '(Ворон.)', '(Вісті)', ' Ворон.)'],
//        ['*Вінниччина*', '«*Вісті*»', '(*Влизько*)', '*Вовчанщина*', '*Вовчанщина*', '*Волчанськ*', '(*Вороніжчина*)', '(«*Вісті*»)', ' *Вороніжчина*)']
//        ,$line
//    );
//
//    $line = str_ireplace(
//        ['В. Підм.', 'В. Підмог.', '(Вх.)', '(Вхр.)', 'Гайсин.', 'Гайсинщ.'],
//        ['*Підмогильний*', '*Підмогильний*', '(*Верхратський*)', '(*Верхратський*)', '*Гайсинщина*', '*Гайсинщина*']
//        ,$line
//    );
//
//    $line = str_ireplace(
//        ['Г. Барв.', 'Г. Велз', 'Г. Думка', 'Гр. Думка', '(Барв.)', '(Велз)'],
//        ['*Г_Барвінок*', '*Велз*', '*Громадська Думка*', '*Громадська Думка*', '(*Г_Барвінок*)', '(*Велз*)']
//        ,$line
//    );
//
//    $line = str_ireplace(
//        ['Герин.', 'Гнід.', 'Гол.', 'Голов.', 'Головац.', 'Гліб.'],
//        ['*Геринович*', '*Гнѣдичъ*', '*Головацкій*', '*Головацкій*', '*Головацкій*', '*Глібів*']
//        ,$line
//    );
//
//    $line = str_ireplace(
//        ['Голов.', 'Г. Григор.', 'Григор.', 'Гр.', 'Грін.', 'Грінч.', 'Греб.'],
//        ['*Головацький*', '*Григоренко*', '*Григоренко*', '*Грінченко*', '*Грінченко*', '*Грінченко*', '*Гребінка*']
//        ,$line
//    );
//
//    $line = str_ireplace(
//        ['Гул.-Артем', 'Гул.-Арт.', 'Гуманщ.', 'Ґерин.', 'Ґ. Шкур.', '(Дещо)', 'Дит. пісня'],
//        ['*Гулак-Артемовський*', '*Гулак-Артемовський*', '*Гуманщина*', '*Ґеринович*', '*Шкурупій*', '(*Дещо*)', '*дитяча пісня*']
//        ,$line
//    );
//
//    $line = str_ireplace(
//        ['Дм. Марков.', 'Дніпропетр.', 'Дніпр. Ч.', 'Дн. Ч.', 'Дн. Чайка', 'Дніпр. Чайка', 'Добровольськ.', 'Д. Марков.', '*Дніпрова Чайка', 'Дм.  Марков.'],
//        ['*Маркович*', '*Дніпропетровщина*', '*Дніпрова Чайка', '*Дніпрова Чайка', '*Дніпрова Чайка', '*Дніпрова Чайка', '*Добровольський*', '*Маркович*', '*Дніпрова Чайка*', '*Маркович*',]
//        ,$line
//    );
//
//    $line = str_ireplace(
//        ['(Марков.)', 'Дом.', 'Доман.', 'Дорошкев.', 'Драг.', 'Драгом.', 'Драг. Пр.', 'Драг. Пред.', 'Едґ. По'],
//        ['(*Маркович*)', '*Доманицький*', '*Доманицький*', '*Дорошкевич*', '*Драгоманов*', '*Драгоманов*', '*Драгоманов*', '*Драгоманов*', '*Едґард Аллан По*']
//        ,$line
//    );
//
//    $line = str_ireplace(
//        ['Еварн.', 'Еккл.', 'Екклез.', 'Ек. Наука', 'Екон. Наука', 'Економ. Н.', 'В. Еллан.', 'Екон. наука', 'Економ. Наука'],
//        ['*Еварницький*', '*Екклезіяст*', '*Екклезіяст*', '*Економічна наука*', '*Економічна наука*', '*Економічна наука*', '*Еллан*', '*Економічна наука*', '*Економічна наука*']
//        ,$line
//    );
//
//    $line = str_ireplace(
//        ['Етн. Зб.', '*Єванг.*', 'Єванг.', 'Єв. Луки', 'Єв. Морач.', 'Етн. Збірн.', 'Єв. Л.', 'Єв. Мт.', '(Єв.)'],
//        ['*«Етнографічний Збірник*','Євангеліє Луки', '*Євангеліє*', '*Євангеліє Луки*', '*Євангеліє*', '*«Етнографічний Збірник*','*Євангеліє Луки*', '*Євангеліє Матвія*', '(*Євангеліє*)']
//        ,$line
//    );
//
//    $line = str_ireplace(
//        ['Єв. Мат.',            'Єв. Мр.',      'Єв. Мор.',  'Єв. Морач.', 'Єв. І.', '(Єв.,'],
//        ['*Євангеліє Матвія*', '*Євангеліє*', '*Євангеліє*', '*Євангеліє*', '*Євангеліє*', '(*Євангеліє*,']
//        ,$line
//    );
//
//    $line = str_ireplace(
//        ['Єфр.', 'Жарт. пісня', 'Сл. Жел.', 'Сл. Желех', 'Житом.', 'Ж. й р', '(Желех.)', '(Жел.)', 'Жел.)'],
//        ['*Єфремов*', '*жартівлива пісня*', '*Желеховский*', '*Желеховский*', '*Житомирщина*', '*Життя й Революція*', '(*Желеховский*)', '(*Желеховский*)', '(*Желеховский*)']
//        ,$line
//    );
//
//    $line = str_ireplace(
//        ['Загір.', 'Закр.', 'Звин.', 'Звиног.', 'Звяг.', 'Звягельщ'],
//        ['*Загірня*', '*Закревскій*', '*Звиногородщина*', '*Звиногородщина*', '*Звягельщина*', '*Звягельщина*']
//        ,$line
//    );
//
//    $line = str_ireplace(
//        ['Зіньківщ.', '**Звягельщина*ина*', '*Звягельщина*.', 'Зміїв. п.', 'Зміївщ.', 'Золотон.', 'ЗОЮР.', 'Івч.', '*Дніпрова Чайка**'],
//        ['*Зіньківщина*', '*Звягельщина*', '*Звягельщина*', '*Зміївський повіт*', '*Зміївщина*', '*Золотонощина*', 'ЗОЮР', '*Івченко*', '*Дніпрова Чайка*']
//        ,$line
//    );
//
//    $line = str_ireplace(
//        ['Іпат. літ.', 'Калит.', 'Каменечч.', 'Кам’янеч.', 'Кам. п.', 'Кам’ян. п.', 'Канівщ.'],
//        ['*Іпатський літопис*', '*Калитовський*', '*Кам’янеччина*', '*Кам’янеччина*', '*Кам’янецький повіт*', '*Кам’янецький повіт*', '*Канівщина*']
//        ,$line
//    );
//
//    $line = str_ireplace(
//        ['Катериносл.', '(Квітка.)', '(Кв.)', '(Квіт.)', 'Київщ.', '(Кирил.)','Кв.-Осн.', '(Осн.)', '(Квітка-Осн.)', '(Осн. '],
//        ['*Дніпропетрівщина*', '(*Квітка*)', '(*Квітка*)', '(*Квітка*)', '*Київщина*', '*Кириленко*', '*Квітка*', '*Квітка*', '*Квітка*', '(*Квітка* ']
//        ,$line
//    );
//
//    $line = str_ireplace(
//        ['(Клин.)', 'Кобел.', 'Кобеляч.', 'Козелеч.',                        '(Kolb.)'],
//        ['(*Клиновецька*)', '*Кобеляччина*', '*Кобеляччина*', '*Козелеччина*', '']
//        ,$line
//    );
//
//    $line = str_ireplace(
//        ['Ком.',      '(Комар.)', 'Конгр.', 'Кон.'                        , 'Конис.', 'Кониськ.',            'Конотіпщ.', 'Конот. п.'],
//        ['*Комаров*','(*Комаров*)', '*Константиноградщина*', '*Кониський*',  '*Кониський*',  '*Кониський*', '*Конотіпщина*', '*Конотопський повіт*']
//        ,$line
//    );
//
//    $line = str_ireplace(
//        ['Корол.', 'Корост.'            , 'Костом.', 'Костомар.', 'Котл.', 'Котляр.'                        , 'Коц.'            , 'Коцюб.'],
//        ['*Короленко*', '*Коростенщина*', '*Костомаров*', '*Костомаров*', '*Котляревський*', '*Котляревський*', '*Коцюбинський*', '*Коцюбинський*']
//        ,$line
//    );
//
//    $line = str_ireplace(
//        ['Кременеч.', 'Кременч.', 'Кременчуч.',                'Кр.', 'Крим.', 'Кримськ.'],
//        ['*Кременеччина*', '*Кременчуччина*', '*Кременчуччина*', '*Кримський*', '*Кримський*', '*Кримський*']
//        ,$line
////    );
//
//    $line = str_ireplace(
//        ['Кролевеч.', 'Кропивн.', 'К. Ст.'                       , 'Е. Стар.', 'К. Старина',                   'Кул.', 'Купал. пісня', 'К. Стар.', '(Стар.)'],
//        ['*Кролевеччина*', '*Кропивницький*', '*Кіевская Старина*', '*Кіевская Старина*', '*Кіевская Старина*', 'Куліш', '*Купалова пісня*', '*Кіевская Старина*', '(*Кіевская Старина*)']
//        ,$line
//    );
//
//    $line = str_ireplace(
//        ['Купал. пісня', 'Лавр.', 'Лебед.', 'Лебедин.', 'Лебединщ.'                         , 'Лепк.', 'Леся Укр.', 'Л. Укр.'],
//        ['*Купалова пісня*)', '*Лавренко*', '*Лебединщина*', '*Лебединщина*', '*Лебединщина*', '*Лепкий*', '*Леся Українка*', '*Леся Українка*']
//        ,$line
//    );
//
//    $line = str_ireplace(
//        ['Леонт.', 'Липовеч.', 'Липов. п.'                    ,'Лобод.',       'Лохв.', 'Лохвич.', 'Луб.', 'Лубенщ.'],
//        ['*Леонтович*', '*Липовеччина*', '*Липовецький повіт*', 'Лободовський', '*Лохвиччина*', '*Лохвиччина*', '*Лубенщина*', '*Лубенщина*']
//        ,$line
//    );
//
//    $line = str_ireplace(
//        ['Лукаш.', 'Люб.',          'Макар.', 'Макаров.', 'Маков.', 'Макс.', 'Манж.'],
//        ['*Лукашевичъ*', '*Любченко*', '*Макаровський*', '*Макаровський*', '*Маковей*', '*Максимович*', '*Манжура*']
//        ,$line
//    );
//
//    $line = str_ireplace(
//        ['Марк.', 'Маркев.',          'Марко В.', 'М. Вовч.', 'М. В.', 'Март.', 'Мартин.', 'Мат. Сл'],
//        ['*Маркевичъ*', '*Маркевичъ*', '*Марко Вовчок*', '*Марко Вовчок*', '*Марко Вовчок*', 'Мартинович', 'Мартинович', '*Словник математичної термінології*']
//        ,$line
//    );
//
//    $line = str_ireplace(
//        ['Мат. Укр. Етн.', 'М. Ворон.',                      'М. Грінч.', 'Мед. слов.', 'Мет.', 'Метл.', 'М. Зер.', 'Мат. укр. Етн. I'],
//        ['*Матеріали до української етнольоґії*', '*Вороний*', '*Грінченкова*', '*Медичний словник*', '*Метлинський*', '*Метлинський*', '*Зеров*', '*Матеріали до української етнольоґії*']
//        ,$line
//    );
//
//    $line = str_ireplace(
//        ['Мед. Сл.', 'Микит.', 'Мил.', 'Милор.', 'Милорад.' , 'Мирг.', 'Миргор.', 'Миргородщ.', 'Мир.', 'Мирн.'],
//        ['*Медичний словник*', '*Микитенко*', '*Милорадович*', '*Милорадович*', '*Милорадович*', '*Миргородщина*', '*Миргородщина*', '*Миргородщина*', '*Мирний*', '*Мирний*']
//        ,$line
//    );
//
//    $line = str_ireplace(
//        ['(Мирний.)', 'Михайлич.'   , 'Міуськ.', 'Міущ.', 'Міюс.', 'М. Калин.', 'М. Костом.', 'Мкр.'],
//        ['*Мирний*', '*Михайличенко*', '*Міющина*', '*Міющина*', '*Міющина*', '*Калинович*', '*Костомаров*', '*Макаровський* ']
//        ,$line
//    );
//
//    $line = str_ireplace(
//        ['Міуськ.', 'Міущ.', 'Міюс.', 'М. Калин.', 'М. Костом.', 'Мкр.', 'Млак.'                        , 'М. Лев.', 'М. Левиц.'],
//        ['*Міющина*', '*Міющина*', '*Міющина*', '*Калинович*', '*Костомаров*', '*Макаровський*', '*Млака*','*Левицький*','*Левицький*']
//        ,$line
//    );
//
//    $line = str_ireplace(
//        ['Млр. лит. сб.', 'М. Макар.', 'Мнж.',                               'Могилівщ.', 'Морач.', 'Морд.', 'Мордов.'],
//        ['*Малорусскій литературный сборникъ*', '*Макаровський*', '*Манжура*', '*Могилівщина*', '*Євангеліє*', '*Мордовцев*', '*Мордовцев*']
//        ,$line
//    );
//
//    $line = str_ireplace(
//        ['М. Сем.', 'М. Скрипн.', 'М. Стариц.', 'М. Хвильов.', 'Навроцьк.', 'Н.-Вол. п.', 'Стариц.', 'Хвильов.', 'Н.Вол. п.', 'Н. Вол.', 'Вол. г.'],
//        ['*Семенко*','*Скрипник*','*Старицький*','*Хвильовий*','*Навроцький*','*Новгород-Волинський повіт*','*Старицький*','*Хвильовий*','*Новгород-Волинський повіт*','*Новгород-Волинський повіт*','*Новгород-Волинський повіт*']
//        ,$line
//    );
//
//    $line = str_ireplace(
//        ['Н. Громада', 'Неч.-Лев.', 'Н.-Л.', 'Н.-Лев.','Ніженщ.', 'Ніков.', 'Ніс.','Неч.Лев.'],
//        ['*Нова Громада*','*Нечуй-Левицький*','*Нечуй-Левицький*','*Нечуй-Левицький*','*Ніженщина*', '*Ніковський*', '*О народной медицинѣ южнороссовъ*','*Нечуй-Левицький*']
//        ,$line
//    );
//
//    $line = str_ireplace(
//        ['Н.-Неч.', 'Неч. Лев.', 'Новомоск.', 'Новомосковщ.', 'Ном.', 'Номис.'],
//        ['*Нечуй-Левицький*', '*Нечуй-Левицький*', '*Новомосковщина*', '*Новомосковщина*', '*Номис*', '*Номис*']
//        ,$line
//    );
//
//    $line = str_ireplace(
//        ['Н. Рада', 'Огон.', 'Одещ.', 'О. Лев.','Ор. Лев.','Ор. Левиц.','Олександр.','Олександрівщ.','Лев.','Левиц.'],
//        ['*Нова Рада*','*Огоновський*','*Одещина*','*Орест Левицький*','*Орест Левицький*','*Орест Левицький*','*Олександрівщина*','*Олександрівщина*','*Орест Левицький*','*Орест Левицький*']
//        ,$line
//    );
//
//    $line = str_ireplace(
//        ['Олм. Примха', 'О. Пчілка', 'Ол. Пчілка.', 'Остерщ.', 'Остр. Скарбів','О. 1862.','Павл.', 'Олм. Примха', 'Ол. Пчілка'],
//        ['*Олмейрова Примха*', '*Олена Пчілка*', '*Олена Пчілка*', '*Остерщина*', '*Острів Скарбів*', '*Основа*','*Павловський*','*Олмейрова Примха*', '*Олена Пчілка*']
//        ,$line
//    );
//
//    $line = str_ireplace(
//        ['Пачов.', 'Переясл.', 'Переяславщ.','Пирят.','Пирятинщ.','Под.','Под. губ.'],
//        ['*Пачовський*','*Переяславщина*','*Переяславщина*','*Пирятинщина*','*Пирятинщина*','*Поділля*','*Подільська губ*']
//        ,$line
//    );
//
//    $line = str_ireplace(
//        ['Полт.', 'Потеб.','Пот. Одис.', 'Правн. Сл.', 'Прик.','Проскур.','Пот.'],
//        ['*Полтавщина*','*Потебня*','*Потебня Одиссея*','*Російсько-український словник правничої мови*', '*приказка*','*Проскурівна*','*Потебня*']
//        ,$line
//    );
//
//    $line = str_ireplace(
//        ['Проскурівщ.', 'Проскур. Уляся','Пр. Правда','Пролет. Пр.','П. Филип.','(Рада.)'],
//        ['*Проскурівщина*', '*Проскурівна*','*Пролетарська Правда*','*Пролетарська Правда*','*Филипович*','(*Рада*)']
//        ,$line
//    );
//
//    $line = str_ireplace(
//        ['Радом.', 'Радомищ.','Раєвськ.','Ржищівщ.','Рильськ.','Р. Край','Роменщ.'],
//        ['*Радомищина*','*Радомищина*','*Раєвський*','*Ржищівщина*','*Рильський*','*Рідний Край*','*Роменщина*']
//        ,$line
//    );
//
//    $line = str_ireplace(
//        ['Ж. й Р.', 'Н. Р.', 'Руд.', 'Рудан.', 'Рудч.','Самійл.', '(Сам.)'],
//        [' ', ' ', '*Руданський*', '*Руданський*', '*Рудченко*','*Самійленко*', '(*Самійленко*)']
//        ,$line
//    );
//
//    $line = str_ireplace(
//        ['Свидн.', 'Свидниц.', 'Св. Л.', 'Св. П.', 'Св. Пис.', 'Сим.', 'Сім.', 'Сімович', 'Св. Письмо', 'знаток Св. Писания'],
//        ['*Свидницький*','*Свидницький*','*Свидницький','*Святе Письмо*','*Святе Письмо*','*Симонов*','*Сімович*','*Сімович*','*Святе Письмо*','*Святе Письмо*']
//        ,$line
//    );
//
//    $line = str_ireplace(
//        ['Сквир. у.', 'Сквирщ.','Сл. Аф.','Сл. Гр.','Сл. Грінч.','Сл. Йог.','Сл. Левч.','Слов’яносербщ.'],
//        ['*Сквирський*','*Сквирщина*','*Афанасьевъ*','*Грінченко*','*Грінченко*','*Йогансен*','*Левченко*','Слов’яносербщина']
//        ,$line
//    );
//
//    $line = str_ireplace(
//        ['Сл. пр. м.', 'Сл. правн. м.'],
//        ['*Російсько-український словник правничої мови*','*Російсько-український словник правничої мови*']
//        ,$line
//    );
//
//    $line = str_ireplace(
//        ['Сл. Ум.', 'Сл. хем. терм.','Сл. Шейк.', 'Сл. Яв.','С. Оран.'],
//        ['*Уманець*', '*Словник хемічної термінології*', '*Опыть южнорусскаго словаря*', '*Яворницького*','*Оранський*']
//        ,$line
//    );
//
//    $line = str_ireplace(
//        ['Сл. *Грінченко*','Сл. Яворн.', 'Сл. Афан.', 'Геол. Сл.','Сл. Дубр.','Сл. Уман.', '(Шейк.)','К. С.','. С. З.'],
//        ['*Грінченко*','*Яворницького*', '*Афанасьевъ*', '*Геологічний*','*Дубровського*','*Уманського*','*Шейковскій*','','']
//        ,$line
//    );
//
//    $line = str_ireplace(
//        ['Сосн.','Стариц.','Старобільщ.','Стар.-Чернях.','Стат. Ак. Н.','Статут Ак. Наук'],
//        ['*Сосницький район*','*Старицький*','*Старобільщина*','*Старицька-Черняхівська*','*Статут Української Академії Наук*','*Статут Української Академії Наук*']
//        ,$line
//    );
//
//    $line = str_ireplace(
//        ['Стар.-Черн.','Стат. Ак. Наук', 'Ст. Ак. Н.','Стар.-Черних.', 'М. Стар.)'],
//        ['*Старицька-Черняхівська*','*Статут Української Академії Наук*','*Статут Української Академії Наук*','*Старицька-Черняхівська*', '']
//        ,$line
//    );
//
//    $line = str_ireplace(
//        ['Стат. Лит.','Ст. Лит.','Стебн.','Степ.','Стеф.','Стор.','Сторож.'],
//        ['*Статут Литовський*','*Статут Литовський*','*Стебницький*','*Степовик*','*Стефаник*','*Стороженко*','*Стороженко*']
//        ,$line
//    );
//
//    $line = str_ireplace(
//        ['Лит. Статут','Статут Лит.','(Стат. Акад. Наук)','(Стат. Акад.)'],
//        ['*Статут Литовський*','*Статут Литовський*','','']
//        ,$line
//    );
//
//    $line = str_ireplace(
//        ['Ст. Савч.', 'Сумщ.','Терещ.','Тесл.','Тоб.','Тобіл.','Троян.','(Ст. УАН)','(Ст. А. Н.)'],
//        ['*Савченко*','*Сумщина*','*Терещенко*','*Тесленко*','*Тобілевич*','*Тобілевич*','*Трояновський*','','']
//        ,$line
//    );
//
//    $line = str_ireplace(
//        ['Тульч.','Тульчинщ.','Тур.','Тур. Охор. роб.','Тутк.','Урядж. Лабор.','Федьк.','Філян.', '(Франко. Пр.)', ' Охор. роб.'],
//        ['*Тульчинщина*','*Тульчинщина*','*Турченко*','*Турченко*','*Тутківськкй*','','*Федькович*','Філянський','', '']
//        ,$line
//    );
//
//    $line = str_ireplace(
//        ['Франко.', 'Фр.', 'Фран.','Харк. Зб.','Харк. Збірн.','Харьк. Сб.','(Харк. п.)'],
//        ['*Франко*','*Франко*','*Франко*','*Харьковскій Сборникъ*','*Харьковскій Сборникъ*','*Харьковскій Сборникъ*','']
//        ,$line
//    );
//
//    $line = str_ireplace(
//        ['Харк.', 'Харківщ.','Хвед. б.','Хведор.','Хведор. Зб.', 'Хвед. Зб.','Хвед.'],
//        ['*Харківщина*', '*Харківщина*','*Хведоровычъ*','*Хведоровычъ*','*Хведоровычъ*','*Хведоровычъ*','*Хведоровычъ*']
//        ,$line
//    );
//
//    $line = str_ireplace(
//        ['Херс.','Херсонщ.','Хорольщ.','Хор. п.','Хотин. п.','Хотинщ.'],
//        ['*Херсонщина*','*Херсонщина*','*Хорольщина*','*Хорольський*'.'*Хотинський*','*Хотинщина*']
//        ,$line
//    );
//
//    $line = str_ireplace(
//        ['Червоногр.','Черкащ.','Черк.','Черкас.','Черніг.','Черн.','Черняв.'],
//        ['*Червоноградщина*','*Черкащина*','*Черкасенко*','*Черкасенко*','*Чернігівщина*','*Чернявський*','*Чернявський*']
//        ,$line
//    );
//
//    $line = str_ireplace(
//        ['Чуб. III', 'Чуб. II', 'Чуб. I', 'Чуб. V', 'Чуб. VII', 'Чуб. VI'],
//        'Чуб.'
//        ,$line
//    );
//
//    $line = str_ireplace(
//        ['Чигир.', 'Чигиринщ.', 'Чорномор.', 'Чуб.', 'Чупр.'],
//        ['*Чигиринщина*', '*Чигиринщина*', '*Чорномор’я*', '*Чубинський*', '*Чупринка*']
//        ,$line
//    );
//
//    $line = str_ireplace(
//        ['Шахм.', 'Шахмат.', 'Шашк.', 'Шевч.', 'Шевчен.', 'Шейк.','Шух.','Щог.','Щогол.','Яворн.','Яворськ.','Я. Савч'],
//        ['*Шахматов*','*Шахматов*','*Шашкевич*','*Шевченко*','*Шевченко*','','*Шухевич*','*Щоголів*','*Щоголів*','*Яворницький*','*Яворскій*','*Савченко*']
//        ,$line
//    );
//
//    $line = str_ireplace(
//        ['авиац.','агрон.', 'анат.','антроп.','аптек.','араб.'],
//        ['*авиационный*','агрономический*','*анатомический*','*антропологический*','*аптекарский*','арабское слово']
//        ,$line
//    );
//
//    $line = str_ireplace(
//        ['ариф.','арифм.','арабское слово','арх.','архаич.'],
//        ['*арифметический*','*арифметический*','*арабское слово*','*архаическое слово*','*архаическое слово*']
//        ,$line
//    );
//
//    $line = str_ireplace(
//        ['археол.','архит.','астр.','астрон.','б. вр.','безл.','биол.'],
//        ['*археологический*','*архитектурный*','*астрономический*','*астрономический*','*майбутній час*','*безособовий*','биологический']
//        ,$line
//    );
//
//    $line = str_ireplace(
//        ['бот.','биологический','букв.','б. употреб. мн.','бухг.','сов.','сов. в.'],
//        ['*ботанический*','*биологический*','*буквально*','*більш вживане у множині*','*бухгалтерский*','*доконаний вид*','*доконаний вид*']
//        ,$line
////    );
//
//    $line = str_ireplace(
//        ['(в.',' в. ', '(созв. '],
//        ['(вид',' *вид* ', '(созвездие ']
//        ,$line
//    );
//
//    $line = str_ireplace(
//        ['варв.','(вежл.', 'вес. пісня', 'ветер.','взаим.','вин. п.'],
//        ['*варваризм*','(*вежливо* ','*весільна пісня*','*ветеринарный*','*взаимный залог*','*винительный падеж*']
//        ,$line
//    );
//
//    $line = str_ireplace(
//        [' воен. ',' военн. ',' возвр. з.', 'возвр. ', ' возвыш. ','(воен. ', '(воен.)', '(военн.)'],
//        [' *военный термин* ',' *военный термин* ', ' *возвратный залог* ', ' *возвратный залог* ', ' *возвышенно* ', '(военный ', '(*военный*)', '(*военный*)']
//        ,$line
//    );
//
//    $line = str_ireplace(
//        [' воен.,', ' воен.)', 'во мн. местах', 'вост.', 'в перен. знач.'],
//        [' *военный термин*,',' *военный термин*)', 'во многих местах', '*восточное слово*', 'в переносном значении']
//        ,$line
//    );
//
//    $line = str_ireplace(
//        ['в прям. и перен. знач.',         'в перен. смысле',    ' перен. знач.',         ' перен.', '(перен.)'],
//        ['в прямом и переносном значении','в переносном смысле', ' переносное значение', ' переносно', '(*переносно*)']
//        ,$line
//    );
//
//    $line = str_ireplace(
//        ['в прям. и перен. знач.',         'в перен. смысле',    ' перен. знач.',         ' перен.', '(перен.)'],
//        ['в прямом и переносном значении','в переносном смысле', ' переносное значение', ' переносно', '(*переносно*)']
//        ,$line
//    );
//
//    $line = str_ireplace(
//        ['(незнач.','в знач. слов', 'в знач. прил.', 'в абстр. знач.', 'в нравст. знач.', 'в общ. знач.', 'в отвл. знач.',],
//        ['(незначний ', 'в значении слов', 'в значении прилогательного', 'а абстрактном значении', 'в нравственном значении', 'в общественном значении', 'в отвлеченном значении',]
//        ,$line
//    );
//
//    $line = str_ireplace(
//        ['обыкнов. во мн. ч.','обычн. во мн.','о мн. или во мн.',],
//        ['обыкновенно во множественном числе','обыкновенно во множественном','о множестве или во множестве',]
//        ,$line
//    );
//
//    $line = str_ireplace(
//        ['во мн. ч.','во мн.','вульг.','галицк.','гал.','выраж.',],
//        ['во множественном числе','во множестве','*вульгарно*','*галицкое слово*','*галицкое слово*','*выражение*',]
//        ,$line
//    );
//
//    $line = str_ireplace(
//        ['(знач.',' знач.', ' геогр.', ' геод.', ' геол.',' геом.'],
//        ['(значение',' значение', ' *географический термин*', ' *геодезический*', ' *геологический*', '*геометрический*']
//        ,$line
//    );
//
//    $line = str_ireplace(
//        ['(геом.', ' геолог.', ' герб.', 'глаг. нрч.'],
//        ['(*геометрический*', ' *геологический*', ' *гербовый*', '*глагольное наречие*']
//        ,$line
//    );
//
//    $line = str_ireplace(
//        [' глаг.', 'првдыдущ.', '(глаг.', 'глг.', 'горн.'],
//        [' *глагол*', 'попередній', '(глагол', 'глагол', '*горнозаводский*']
//        ,$line
//    );
//
//    $line = str_ireplace(
//        [' грам.', ' грамм.', 'гуц.', 'действ. з.'],
//        [' *грамматический термин*', ' *грамматический термин*', ' *гуцульское слово*', '*действительный залог*']
//        ,$line
//    );
//
//    $line = str_ireplace(
//        [' действ. зал.', ' делик.', ' дет.', ' детс.', ' детск.', ' диал.', ' диалект.'],
//        [' *действительный залог*', ' *деликатно*', ' *детское слово*', ' *детское слово*', ' *детское слово*', ' *диалектизм*', ' *диалектизм*']
//        ,$line
//    );
//
//    $line = str_ireplace(
//        ['(детск.', 'ед. ч.', ' жарг.', 'ж. р.', ' зап.', ' зах.'],
//        ['(*детское слово*', '*однина*', ' *жаргон*', '*жіночий рід*', ' *западно-украинское слово*', ' *західне*']
//        ,$line
//    );
//
//    $line = str_ireplace(
//        [' мн. ч.', '(зап.', ' зват.', 'земледельч.', ' зал.', ' зоол.', ' зоотехн.'],
//        [' *множина*', '(західне', ' *кличний*', '*земледельческий*', ' *залог*', ' *зоологический*', ' *зоотехнический*']
//        ,$line
//    );
//
//    $line = str_ireplace(
//        [' изв.', ' иноск.', ' инстр.', ' и пр. ', ' ирон.', ' иронич.'],
//        [' *известный*', ' *иносказательно*', ' *инструмент*', ' *и прочее* ', ' *иронически*', ' *иронически*']
//        ,$line
//    );
//
//    $line = str_ireplace(
//        ['(ирон.', '(иронич.', ' и пр.', '(инстр.', '(иноск.'],
//        ['(иронически', '(иронически', ' *и прочее*', '(инструмент', '(иносказательно']
//        ,$line
//    );
//
//    $line = str_ireplace(
//        [' испорч.', 'ист.-лит.', ' истор.', ' ист.', ' и т. д.', ' и т. п.'],
//        [' испорченное слово', 'историко-литературный термин', ' исторический', ' исторический', ' и так далее', ' и тому подобное']
//        ,$line
//    );
//
//    $line = str_ireplace(
//        ['\'и т. д.', ' і т. и.', ' ихтиол.', ' канц.', ' канцел.'],
//        [' и так далее', ' і таке інше', ' ихтиологический', ' канцелярское выражение', ' канцелярский термин']
//        ,$line
//    );
//
//    $line = str_ireplace(
//        [' книжн.', ' кожев.', ' колич.', ' комм.', ' кулин.', ' к.-ч.'],
//        [' книжное слово', ' в кожевенном деле', ' количественный', ' коммерческий термин', ' кулинарный', ' кем-чем']
//        ,$line
//    );
//
//    $line = str_ireplace(
//        [ ' ласк. назв.',' ласк.', ' ласкат.', ' лингв.', ' литогр.'],
//        [ ' ласкательное название',' ласкательно', ' ласкательно', ' лингвистический', ' литографский']
//        ,$line
//    );
//
//    $line = str_ireplace(
//        [ '(ласк.', '(ласкат.', '(ласк. назв.', ' личн.', ' лог.', ' малоупотр.'],
//        [ '(ласкательно', '(ласкательно', '(ласкательное название', ' личное', ' логический термин', ' малоупотребительное слово']
//        ,$line
//    );
//
//    $line = str_ireplace(
//        [ ' ум.-ласк.', ' матем.', ' мат.', ' мед.', ' медиц.', 'медиц. терм.'],
//        [ ' уменшительно-ласкательно', ' математический термин', ' математический термин', ' медицинский термин', 'медицинский термин', ' медицинский термин']
//        ,$line
//    );
//
//    $line = str_ireplace(
//        [ 'мед. слов.', ' метал.', ' металлург.', ' метеор.', 'механ.'],
//        [ 'медицинское слово', '  металургический', '  металургический', ' метеорологический', ' термин в механике']
//        ,$line
//    );
//
//    $line = str_ireplace(
//        [' мин.', ' минер.', 'м. и ср.', ' миф.', ' мифол.','(мин.)','(минер.)','(мифол.)'],
//        [' *термин в минералогии*',' *термин в минералогии*', '*мужеский и средний род*','*мифологический*','*мифологический*','*термин в минералогии*','*термин в минералогии*','*мифологический*']
//        ,$line
//    );
//
//    $line = str_ireplace(
//        ['(минер.', ' многокр.', ' мн. ч.', ' множ.','(многокр.)','(мн. ч.','(множ.)'],
//        ['(*термин в минералогии*', ' *многократное действие*', ' *множественное число*', ' *множественное число*', ' *многократное действие*','(*множественное число*', '(*множественное число*)']
//        ,$line
//    );
//
//    $line = str_ireplace(
//        ['(множ.', 'морск.', ' мор.', '(мор.'],
//        ['(*множественное число*','*морской термин*',' *морской термин*','(*морской термин*']
//        ,$line
//    );
//
//    $line = str_ireplace(
//        ['москов.', ' муз.', '(муз.', ' м. ч.', '(м. ч.'],
//        ['*московское слово*', ' *музыкальный термин*', '(музыкальный термин*', ' *множественное число*', '(*множественное число*']
//        ,$line
//    );
//
//    $line = str_ireplace(
//        [' музык.', '(музык.', ' н. вр.', '(н. вр.'],
//        [' *музыкальный термин*', '(музыкальный термин*', ' *настоящее время*', '(*настоящее время*']
//        ,$line
//    );
//
//    $line = replace_2($line,[
//        'напр.' => 'например',
//        'напыщ.' => 'напыщенно',
//        'нар. врем.' => 'наречие времени',
//        'народ.' => 'народное слово',
//        'народн.' => 'народное слово',
//        'нар. тв.' => 'народное творчество',
//        'насек.' => 'насекомое',
//        'насм.' => 'насмешливо',
//        'насмеш.' => 'насмешливо',
//        'насмешл.' => 'насмешливо',
//    ]);
//
//    $line = replace_2($line,[
//        'наст. вр.' => 'настоящее время',
//        'науч.' => 'научный термин',
//        'научн.' => 'научный термин',
//        'неизм.' => 'неизменяемое',
//        'нелит.' => 'нелитературное',
//        'нелитер.' => 'нелитературное',
//        'неодобрит.' => 'неодобрительно',
//        'неодуш.' => 'неодушевленный',
//        'неодушевл.' => 'неодушевленный',
//        'неоконч.' => 'неоконченное действие',
//        'неол.' => 'неологизм',
//        'неопр.' => 'неопределенно',
//    ]);
//
//    $line = replace_2($line,[
//        'неполноскл.' => 'неполносклоняемое',
//        'неск.' => 'несклоняемое слово',
//        'нескл.' => 'несклоняемое слово',
//        'несклон.' => 'несклоняемое слово',
//        'несов.' => 'несовершенный вид',
//        'несов. в.' => 'несовершенный вид',
//        'неспряг.' => 'неспрягаемое слово',
//        'нпр.' => 'например',
//        'нрч.' => 'наречие',
//        'нумизм.' => 'термин в нумизматике',
//        'об. р.' => 'общего рода',
//        'общ. р.' => 'общего рода',
//        'общ.' => 'общего рода',
//        'обычн.' => 'обычно',
//        'однокр.' => 'однократная форма',
//        'одуш.' => 'одушевленный',
//        'одушевл.' => 'одушевленный',
//    ]);

//    $line = replace_2($line,[
//        'оконч.' => 'оконченное действие',
//        'о мног.' => 'о многих',
//        'о множ.' => 'о множестве',
//        'о мужч.' => 'о мужчине',
//        'опис.' => 'описательно',
//        'описат.' => 'описательно',
//        'опред.' => 'определение',
//        'оптич.' => 'оптический',
//        'орнит.' => 'орнитологический',
//        'оруд.' => 'орудный (творительный) падеж',
//        'оруд. пад.' => 'орудный (творительный) падеж',
//        'особ.' => 'особенно',
//        'отвлеч.' => 'отвлеченно',
//        'отгл. межд.' => 'отглагольное междуметие',
//    ]);
//
//    $line = replace_2($line,[
//        'отгл. сущ.' => 'отглагольное существительное',
//        'во мног.' => 'во многих',
//        'неопред.' => 'неопределенно',
//        'отдален.' => 'отдаленно',
//        'отриц.' => 'отрицание, отрицательный, отрицательно',
//        'охот.' => 'термин у охотников',
//        'о челов.' => 'о человеке',
//        'палеонт.' => 'палеонтологический',
//        'перен.' => 'переносно',
//        'перс.' => 'персидское слово',
//        'песен.' => 'песенное',
//        'повел.' => 'повелительное наклонение',
//        'пов. п.' => 'повелительное наклонение',
//        'политич.' => 'политический',
//        'полож.' => 'положительный',
//        'полон.' => 'полонизм',
//    ]);
//
//    $line = replace_2($line,[
//        'мног.' => 'многие',
//        'отгл.' => 'отглагольное',
//        'сущ.' => 'существительное',
//        'челов.' => 'человек',
//        'указат.-отриц.' => 'указание-отрицание',
//        'посл.' => 'пословица',
//        'послов.' => 'пословица',
//        'почт.' => 'почтовый',
//        'поэтич.' => 'поэтически',
//        'правобер.' => 'правобережное слово',
//        'превосх.' => 'превосходный',
//        'предл.' => 'предлог',
//        'презр.' => 'презрительно',
//        'презрит.' => 'презрительно',
//        'преим.' => 'преимущественно',
//        'прен.' => 'пренебрежительно',
//        'пренебр.' => 'пренебрежительно',
//        'пренебреж.' => 'пренебрежительно',
//        'прил.' => 'прилагательное',
//        'прилаг.' => 'прилагательное',
//        'прл.' => 'прилагательное',
//    ]);
//
//    $line = replace_2($line,[
//        'ув.-презр.' => 'увеличено-презрительно',
//        'народнопоэтич.' => 'народнопоэтично',
//        'ув.-пренебр.' => 'увеличено-пренебрежительно',
//        'принадлежн.' => 'принадлежность',
//        'принуд.' => 'принудительно',
//        'прит. пр.' => 'притяжательное прилагательное',
//        'прит. прил.' => 'притяжательное прилагательное',
//        'прлг.' => 'прилагательное',
//        'пров.' => 'провинциализм',
//        'провинц.' => 'провинциализм',
//        'произв.' => 'производный',
//        'прош. врем.' => 'прошедшее время',
//        'пр. вр.' => 'прошедшее время',
//        'прч.' => 'причастие',
//        'психич.' => 'психически',
//        'радио.' => 'радиотехнический',
//        'раст.' => 'растение',
//        'ритор.' => 'риторический',
//        'род. мн.' => 'родительный падеж множественного числа',
//    ]);
//
//    $line = replace_2($line,[
//        'ц.-слав.' => 'церковно-словянский',
//        'церк.-слав.' => 'церковно-словянский',
//        'ц.слав.' => 'церковно-словянский',
//        'твор. п.' => 'творительный падеж',
//        'иносказ.' => 'иносказательно',
//        'подсказ.' => 'подсказака',
//    ]);
//
//    $line = replace_2($line,[
//        'росл.' => 'рослина',
//        'р. п.' => 'родительный падеж',
//        'ругат.' => 'ругательно',
//        'рус.' => 'руссизм',
//        'саркаст.' => 'саркастически',
//        'сз.' => 'сполучник',
//        'сказ.' => 'сказуемое',
//        'сказ. безл. предл.' => 'сказуемое безличного предложения',
//        'слав.' => 'славянизм',
//        'славян.' => 'славянизм',
//        'слес.' => 'в слесарном ремесле',
//        'сложн.' => 'сложный',
//        'смехотв.' => 'смехотворное слово',
//        'соб.' => 'собирательное',
//        'собир.' => 'собирательное',
//        'сокр.' => 'сокращённо',
//        'сомнит.' => 'сомнительное',
//    ]);
//
//    $line = replace_2($line,[
//        'соотв.' => 'соответственно',
//        'спец.' => 'специальное',
//        'спорт.' => 'спортивный термин',
//        'сравн. степ.' => 'сравнительная степень',
//        'ср. з.' => 'средний залог',
//        'с. р.' => 'средний род',
//        'ср. р.' => 'средний род',
//        'ср. ст.' => 'сравнительная степень',
//        'срв.' => 'сравни',
//        'срвн.' => 'сравни',
//        'срв. ст.' => 'сравнительная степеньсрв. ст.',
//        'ср. зал' => 'средний залог',
//        '*старое слово*' => 'стар',
//        'устар.' => 'старое слово',
//        'стар.' => 'старое слово',
//        'старинн.' => 'старинное слово',
//        'степ.' => 'степень',
//        'стихосл.' => 'в стихосложении',
//        'столяр.' => 'столяр.',
//        'страд.' => 'страдательный залог',
//        'страд. зал.' => 'страдательный залог',
//    ]);
//
//    $line = replace_2($line,[
//        'постеп.' => 'постепенно',
//        'столяр.' => 'столярный',
//        'страд. прич.' => 'страдательное причастие',
//        'стр. з.' => 'страдательный залог',
//        'строит.' => 'строительный',
//        'сущ. ж. р.' => ' существительное женского рода',
//        'сущ. общ.' => 'существительное общего рода',
//        'сщ.' => 'существительное',
//        'сущ.' => 'существительное',
//        'татар.' => 'татарское слово',
//        'тв. п.' => 'творительный падеж',
//        'т.-е.' => 'то-есть',
//        'театр.' => 'театральный термин',
//        'текст.' => 'текстильный',
//        'техн.' => 'технический термин',
//        'тип.' => 'типографский термин',
//        'типогр.' => 'типографский термин',
//        'т. н.' => 'так называемый',
//        'торг.' => 'в торговле',
//    ]);
//
//    $line = replace_2($line,[
//        'торж.' => 'торжественно',
//        'торжеств.' => 'торжественно',
//        'турец.' => 'турецкое слово',
//        'турк.' => 'турецкое слово',
//        'тюрк.' => 'тюркское слово',
//        'увел.' => 'увеличительная форма',
//        'увелич.' => 'увеличительная форма',
//        'ув.-презр.' => 'увеличительно-презрительная форма',
//        'умен.' => 'уменьшительная форма',
//        'уменьш.' => 'уменьшительная форма',
//        'укр. яз.' => 'українска мова',
//        'укр.' => 'украинизм',
//        'умств.' => 'умственно',
//        'уничиж.' => 'уничижительно',
//        'употр.' => 'употребляется',
//        'усеч.' => 'усечённый',
//        'усил.' => 'усилительный',
//        'усилит.' => 'усилительный',
//        'устар.' => 'устарелое слово',
//    ]);
//
//    $line = replace_2($line,[
//        'малоупотр.' => 'малоупотребительное',
//        'фабр.' => 'фабричный',
//        'фам.' => 'фармакологический',
//        'фамил.' => 'фармакологический',
//        'физ.' => 'термин в физике',
//        'физич.' => 'термин в физике',
//        'физиол.' => 'физиологический термин',
//        'филол.' => 'филологический',
//        'филос.' => 'философский термин',
//        'форт.' => 'фортификационный термин',
//        'фортиф.' => 'фортификационный термин',
//        'хим.' => 'химический термин',
//        'химич.' => 'химический термин',
//        'хирург.' => 'хирургический',
//        'хронол.' => 'хронологически',
//        'церк.' => 'церковное слово',
//        'церковн.' => 'церковное слово',
//        'ц.-сл.' => 'церковно-славянское слово',
//        'црк. сл.' => 'церковно-славянское слово',
//        'црксл.' => 'церковно-славянское слово',
//    ]);
//
//    $line = replace_2($line,[
//        'церк. утв.' => 'церковная утварь',
//        'част.' => 'частица',
//        'ч.-л.' => 'что-либо',
//        'что-н.' => 'что-нибудь',
//        'шут.' => 'шутливо',
//        'шутл.' => 'шутливо',
//        'шутлив.' => 'шутливо',
//        'шуточн.' => 'шуточно',
//        'эвфем.' => 'эвфемистический',
//        'экон.' => 'экономический',
//        'электротехн.' => 'электротехнический',
//        'энтом.' => 'энтомологический',
//        'юрид.' => 'юридический термин',
//        'юрид. терм.' => 'юридический термин',
//    ]);

//    $line = replace_2($line,[
//        'мед.' => 'медичний',
//        'сред.' => 'середній',
//        'соед.' => 'соединять',
//        'завед.' => 'заведение',
//        'развед.' => 'разведка',
//        'ед.' => 'единственное число',
//        'пред.' => 'попередній',
//        'нар.' => 'наречие',
//        'след.' => 'наступне',
//    ]);
//
//    $line = replace_2($line,[
//        'действ.' => '',
//        'придат.' => '',
//        'книжн.' => '',
//        'изурод.' => '',
//        'Старод.' => '',
//        'инструм.' => '',
//        'обдум.' => '',
//    ]);
//
//    $line = replace_2($line,[
//        'См.' => '',
//        'грамм.' => '',
//        ' яз.' => '',
//        'баз.' => '',
//        'гориз.' => '',
//        'мельн.' => '',
//        'вертик.' => '',
//        'геогр.' => '',
//        'стар.' => '',
//        'Укр.' => '',
//        'g.' => '',
//        'п.' => '',
//    ]);
//
//    $line = replace_2($line,[
//        'Л.-Укр.' => '',
//        'яз.' => '',
//        'Чернігівщ.' => '',
//        'Любечч.' => '',
//        'возвыш.' => '',
//        'Верхрат.' => '',
//        'L.' => '',
//        'астром.' => '',
//        'женщ.' => '',
//        'Федор.' => '',
//        'Чайч.' => '',
//        'Азб. Комун.' => '',
//        'церковносл.' => '',
//        'Одис.' => '',
//        'І.' => '',
//    ]);
//
//    $line = replace_2($line,[
//        'диал.' => '',
//        'пов.' => '',
//        'растительн.' => '',
//        'масл.' => '',
//        'Київ.' => '',
//        'нов.' => '',
//        'слаб.' => '',
//        'прич.' => '',
//        'дейст.' => '',
//    ]);
//
//    $line = replace_2($line,[
//        'слабит.' => '',
//        'лог.' => '',
//        'зоол.' => '',
//        'стекл.' => '',
//        'жестян.' => '',
//        'дерев.' => '',
//        'больш.' => '',
//        'глинян.' => '',
//        'б.' => '',
//        'оплет.' => '',
//        'животн.' => '',
//        'l.' => '',
//        'авг.' => '',
//        'янв.' => '',
//        'сент.' => '',
//        'относ.' => '',
//        'к.' => '',
//        'погов.' => '',
//        'хмельн.' => '',
//        'нап.' => '',
//        'Прич.' => '',
//        'Ор.' => '',
//        'Левицьк.' => '',
//        'ж.' => '',
//        'ор.' => '',
//        'Посл.' => '',
//        'промокат.' => '',
//        'вин.' => '',
//        'отвлечен.' => '',
//        'значен.' => '',
//        'др.' => '',
//    ]);
//
//    $line = replace_2($line,[
//        'Звиногор.' => '',
//        'что-л.' => '',
//        'в.' => '',
//        'т.' => '',
//        'ин.' => '',
//        'под.' => '',
//        'матем.' => '',
//        'Л.' => '',
//        'Україн.' => '',
//        'возвр.' => '',
//        'испоконв.' => '',
//        'грам.' => '',
//        'небольш.' => '',
//        '-му.' => '',
//        'обладат.' => '',
//        'соверш.' => '',
//    ]);
//
//    $line = replace_2($line,[
//        'жит.' => '',
//        'чого-неб.' => '',
//        'Ніковськ.' => '',
//        'Червіг.' => '',
//        'фамильяр.' => '',
//        'Casp.' => '',
//        'геол.' => '',
//        'полов.' => '',
//        'возб.' => '',
//        'чего-л.' => '',
//        'праздн.' => '',
//        'утв.' => '',
//        'свеч.' => '',
//        'Некраш.' => '',
//        'детс.' => '',
//        'жив.' => '',
//        'существ.' => '',
//    ]);
//
//    $line = replace_2($line,[
//        'созв.' => '',
//        'пад.' => '',
//        'един.' => '',
////        'ч.' => '',
//        'чему-л.' => '',
//        'диалектич.' => '',
//        'нареч.' => '',
//        'орудн.' => '',
//        'мучит.' => '',
//        'непочтит.' => '',
//        'диалект.' => '',
//        'медиц.' => '',
//        'сах.' => '',
//        'зав.' => '',
//        'зах.' => '',
////        'д.' => '',
//        'геолог.' => '',
//        'старинн.' => '',
//        'катол.' => '',
//        'перечисл.' => '',
//        'куш.' => '',
//        'терм.' => '',
//    ]);
//
//    $line = replace_2($line,[
//        'меньшит.' => '',
//        'турецк.' => '',
//        'металлическ.' => '',
//        'цилиндрич.' => '',
//        'где-л.' => '',
//        'Крил.' => '',
//        'коп.' => '',
//        'ассигн.' => '',
//        'делик.' => '',
//        'крас.' => '',
//        'художн.' => '',
//        'Грікч.' => '',
//        'грудн.' => '',
//        'внутр.' => '',
//        'Арт.' => '',
//        'арифмет.' => '',
//        'руг.' => '',
//        'жен.' => '',
//        'анатом.' => '',
//        'этногр.' => '',
//        'М. Вов.' => '',
//        'прик.' => '',
//        'Коннс.' => '',
//        'администр.' => '',
//        'M.' => '',
//        'Lam.' => '',
//    ]);
//
//    $line = replace_2($line,[
//        'уменьшит.' => '',
//        'Присл.' => '',
//        'камен.' => '',
//        'кирпичн.' => '',
//        'неодобр.' => '',
//        'револьв.' => '',
//        'вм.' => '',
//        'лир.-эпич.' => '',
//        'лир.' => '',
//        'эпич.' => '',
//        'стих.' => '',
//        'причетн.' => '',
//        'л.' => '',
//        'прененебр.' => '',
//        'чувствит.' => '',
//        'обряд.' => '',
//        'отд.' => '',
//        'насеком.' => '',
//        'Біл.Нос.' => '',
//        'губ.' => '',
//        'болезн.' => '',
//    ]);
//
//    $line = replace_2($line,[
//        'друг.' => '',
//        'растен.' => '',
//        'искусств.' => '',
//        'деревян.' => '',
//        'религ.' => '',
//        'топл.' => '',
//        'Зв.' => '',
//        'канцел.' => '',
//        'горизонтальн.' => '',
//        'водосточн.' => '',
//        'наклонн.' => '',
//        'забавл.' => '',
//        'Руданськ.' => '',
//        'сост.' => '',
//        'грубов.' => '',
//        'Круш.' => '',
//        'металлоплавильн.' => '',
//        'Рудав.' => '',
//        'отн.' => '',
//        'кого-л.' => '',
//        'сапожн.' => '',
//    ]);
//
//    $line = replace_2($line,[
//        'чем-л.' => '',
//        'устн.' => '',
//        'письмен.' => '',
//        'рыбол.' => '',
//        'Ковелечч.' => '',
//        'дополн.' => '',
//        'бытов.' => '',
//        'астроном.' => '',
//        'Хот.' => '',
//        'St. media Vill.' => '',
//        'Конотіп.' => '',
//        'собират.' => '',
//        'Борд.' => '',
//        'саркастич.' => '',
//        'Піскун.' => '',
//        'солнечн.' => '',
//        'вертикальн.' => '',
//        'Симов.' => '',
//        'недобр.' => '',
//        'плотн.' => '',
//        'П.' => '',
//        'Мог.' => '',
//    ]);
//
//    $line = replace_2($line,[
//        'окон.' => '',
//        'Словн. Левч.' => '',
//        'Словн.' => '',
//        'Левч.' => '',
//        'Полтавщ.' => '',
//        'неперех.' => '',
//        'неоффиц.' => '',
//        'Липов.' => '',
//        'куда-н.' => '',
//        'дух. отнош.' => '',
//        'дух.' => '',
//        'отнош.' => '',
//        'непреод.' => '',
//        'влечен.' => '',
//        'что.-н.' => '',
//        'тяж. раб.' => '',
//        'тяж.' => '',
//        'раб.' => '',
//        'мехов.' => '',
//        'Троянов.' => '',
//        'Азб. ком.' => '',
//        'Азб.' => '',
//        'ком.' => '',
//        'Кор.' => '',
//        'Черном.' => '',
//    ]);
//
//    $line = replace_2($line,[
//        'чему-н.' => '',
//        'утрен.' => '',
//        'Чутрен.' => '',
//        'унт.-офиц.' => '',
//        'црк.-сл.' => '',
//        'гр.-делающая' => '',
//        'Д.-горбыль' => '',
//        'Г.-Арт.' => '',
//        'Б.-*Орест Левицький*' => '',
//        'Н.-Лен.' => '',
//        'Н.-Волин. ' => '',
//        'Н.-Волин.' => '',
//        'Карп.-Карий' => '',
//        'как.-ниб.' => '',
//        'поэт.' => '',
//        'драм.' => '',
//        'кожевенн.' => '',
//        'назв.' => '',
//        'землем.' => '',
//        'карт.' => '',
//        'бильярдн.' => '',
//        'растит.' => '',
//        'минеральн.' => '',
//        'эфирн.' => '',
//    ]);
//
//    $line = replace_2($line,[
//        'ст.' => '',
//        'преимущ.' => '',
//        'курительн.' => '',
//        'предыдущ.' => '',
//        'восклиц.' => '',
//        'бочарн.' => '',
//        'кузн.' => '',
//        'творч.' => '',
//        'дат.' => '',
//        'твор.' => '',
//        'собств.' => '',
//        'свойств.' => '',
//        'шорн.' => '',
//        'геометр.' => '',
//        'Литер.' => '',
//        'угор.' => '',
//        'лемк.' => '',
//        'плотничн.' => '',
//        'столярн.' => '',
//        'чегол.' => '',
//        'живот.' => '',
//        'Геогр.' => '',
//        'штукат.' => '',
//        'Григ.' => '',
//    ]);
//
//    $line = replace_2($line,[
//        'кому-л.' => '',
//        'чьём-л.' => '',
//        'кн. сл.' => '',
//        'кн.' => '',
//        'сл.' => '',
//        'неок.' => '',
//        'кем-н.' => '',
//        'ким-н.' => '',
//        'кого-н.' => '',
//        'свойствен.' => '',
//        'Sm.' => '',
//        'речн.' => '',
//        'истор.' => '',
//        'охотн.' => '',
//        'южн.' => '',
//        'прошл.' => '',
//        'будущ.' => '',
//        'стол.' => '',
//        'прош. вр.' => '',
//        'прош.' => '',
//        'вр.' => '',
//        'буд.' => '',
//        'литер.' => '',
//        'наст.' => '',
//        'разгов.' => '',
//        'отвлечённ.' => '',
//    ]);
//
//    $line = replace_2($line,[
//        'геогноз.' => '',
//        'канц.' => '',
//        'кем.-л.' => '',
//        'кем.-н.' => '',
//        'Веч.-*Орест' => '',
//        'чем.-л.' => '',
//        'пол.-эконом.' => '',
//        'эконом.' => '',
//        'пол.' => '',
//        'Н.-Рада' => '',
//        'Новг.-Сів.' => '',
//        'кому-неб.' => '',
//        'чого-не\'б.' => '',
//        'неполносклон.' => '',
//        'що-н.' => '',
//        'Чернігів.' => '',
//        'Башт.' => '',
//        'Загірн.' => '',
//        'Мл. сб.)' => '',
//        'Хаківщ.' => '',
//        'Свид.' => '',
//        'Катеринославщ.' => '',
//        'Борзен.' => '',
//        'Клцюб.' => '',
//        ' Пахар.' => '',
//        'Ів. Виш.' => '',
//        'Виш.' => '',
//        'Касян.' => '',
//        'Липовечч.' => '',
//        'Берд.' => '',
//    ]);
//
//    $line = replace_2($line,[
//        'переносн.' => '',
//        'находящ.' => '',
//        'Бердян. н.' => '',
//        'Бердян.' => '',
//        'н.' => '',
//        'Звиногородщ.' => '',
//        'Евар.' => '',
//        'этимол.' => '',
//        'неожид.' => '',
//        'Крик.' => '',
//        'Н. Гром.' => '',
//        'Гром.' => '',
//        'крестн. знамен.' => '',
//        'знамен.' => '',
//        'крестн.' => '',
//        'Пр.' => '',
//        'гуцул.' => '',
//        '-ласк.' => '',
//        'ласк.' => '',
//        'угорск.' => '',
//        'Катерин.' => '',
//        'Звив.' => '',
//        'Бонд. вироб.' => '',
//        'вироб.' => '',
//        'Бонд.' => '',
//    ]);
//
//    $line = replace_2($line,[
//        'мат.' => '',
//        'Гн.' => '',
//        'Гайс.' => '',
//        'заразн.' => '',
//        'больн.' => '',
//        'Цег.' => '',
//        'Чигирин.' => '',
//        'Єван.' => '',
//        'Врх.' => '',
//        'уст.' => '',
//        'М. Рильс.' => '',
//        'Рильс.' => '',
//        'М.' => '',
//        '*Словник математичної термінології*.' => '',
//        'предм.' => '',
//        'Аф.' => '',
//        'Кроп.' => '',
//        'Явора.' => '',
//        'Кот.' => '',
//        'греч.' => '',
//        'восточ.' => '',
//        'Залюб.' => '',
//        'Крон.' => '',
//        'вопросит.' => '',
//        'порицат.' => '',
//    ]);
//
//    $line = replace_2($line,[
//        '*смотри*-ласк.' => '',
//        'невинн. характ.' => '',
//        'характ.' => '',
//        'невинн.' => '',
//        'амер.' => '',
//        'необход.' => '',
//        'абстр.' => '',
//        'устарел.' => '',
//        'практич.' => '',
//        'человеч.' => '',
//        'оффиц.' => '',
//        'сочин.' => '',
//        'Ш.' => '',
//        'неокон.' => '',
//        'Єфрем.' => '',
//        'окр.' => '',
//        'Груш.' => '',
//        'Гриб.' => '',
//        'простов.' => '',
//        'догмат.' => '',
//        'Велик. вірша.' => '',
//        'вірша.' => '',
//        'Велик.' => '',
//        'Е.' => '',
//        'бухгалт.' => '',
//        'нариц.' => '',
//        'срб.' => '',
//        'выр.' => '',
//    ]);
//
//    $line = replace_2($line,[
//        'накл.' => '',
//        'совр.' => '',
//        'купальн.' => '',
//        '-д.' => '',
//        'сокращ.' => '',
//        'переспрашив.' => '',
//        'утверд.' => '',
//        'Г.Арт.' => '',
//        'желательн.' => '',
//        'Врвч.' => '',
//        'причин.' => '',
//        'обыкн.' => '',
//        'худож.' => '',
//        'простонародн.' => '',
//        'Богодух.' => '',
//        'усопш.' => '',
//        'молитв.' => '',
//        'Рус. Дн.' => '',
//        'Дн.' => '',
//        'Рус.' => '',
//        'Прип.' => '',
//        'относящ.' => '',
//        'общеж.' => '',
//        'Линовеч.' => '',
//        'юморист.' => '',
//    ]);
//
//    $line = replace_2($line,[
//        'архитект.' => '',
//        '-топогр.' => '',
//        'железн.' => '',
//        'слабительн.' => '',
//        'арестн. помещ.' => '',
//        'помещ.' => '',
//        'арестн.' => '',
//        'результ.' => '',
//        'каменщ.' => '',
//        'приблиз.' => '',
//        'Явор.' => '',
//        'безлич.' => '',
//        'Шухев.' => '',
//        'пром.' => '',
//        'иносказат.' => '',
//        'Грушев.' => '',
//        'настольн.' => '',
//        'местоим. вопрос.' => '',
//        'вопрос.' => '',
//        'местоим.' => '',
//        'франц.' => '',
//        'Опат.' => '',
//        'необмолоч.' => '',
//        'ткацк.' => '',
//    ]);
//
//    $line = replace_2($line,[
//        'металл.' => '',
//        'Капельг.' => '',
//        'поздравл.' => '',
//        'раздраж.' => '',
//        'коммерч.' => '',
//        'Теел.' => '',
//        'виолонч.' => '',
//        'необ’езж.' => '',
//        'усилен.' => '',
//        'Сфр.' => '',
//        'каменноуг.' => '',
//        'мельничн.' => '',
//        'направл.' => '',
//        'Мозирщ.' => '',
//        'Максим.' => '',
//        'Богусл.' => '',
//        'сгущен.' => '',
//        'Гуман.' => '',
//        'искаж.' => '',
//        'неолог.' => '',
//        'Дим.' => '',
//        'Турген.' => '',
//        'Поділля.' => '',
//    ]);
//
//    $line = replace_2($line,[
//        'Передм.' => '',
//        'Гайдам.' => '',
//        'Прим.' => '',
//        'Лермонт.' => '',
//        'Борвенщ.' => '',
//        'Золотоніщ.' => '',
//        'Бондарн. виробн.' => '',
//        'виробн.' => '',
//        'Бондарн.' => '',
//        'метаф.' => '',
//        'Криж.' => '',
//        'текстильн.' => '',
//        'малярн.' => '',
//        'кратк. фор.' => '',
//        'фор.' => '',
//        'кратк.' => '',
//        'Стефан.' => '',
//        'визант.' => '',
//        'Н.*Орест Левицький*' => '',
//        'Ehrh.' => '',
//        'Asch.' => '',
//        'Smith.' => '',
//        'Знин.' => '',
//        'Ушиц.' => '',
//        'Богод.' => '',
//        'Кониск.' => '',
//    ]);
//
//    $line = replace_2($line,[
//        'Гайд.' => '',
//        'Мирт.' => '',
//        'исключен.' => '',
//        'Житомирщ.' => '',
//        'Гнат.' => '',
//        'Сб.' => '',
//        'алг.' => '',
//        'Алекс.' => '',
//        'Зіньк.' => '',
//        'Богодухівщ.' => '',
//        'предлож.' => '',
//        'Подтавщ.' => '',
//        'банк.' => '',
//        'метафор.' => '',
//        'бирж.' => '',
//        'промышл.' => '',
//        'Афан.' => '',
//        ' – Пушк.' => '',
//        'гиперб.' => '',
//        'кожев.' => '',
//        'Ait.' => '',
//        'Rich.' => '',
//        'Вовчан.' => '',
//        'шахм.' => '',
//        'Мотл.' => '',
//    ]);
//
//    $line = replace_2($line,[
//        '– Пушк.' => '',
//        'лобов. выпукл.' => '',
//        'выпукл.' => '',
//        'лобов.' => '',
//        'эротическ.' => '',
//        'колесн.' => '',
//        'англ.' => '',
//        'Козелечч.' => '',
//        'агроном.' => '',
//        'Срв.' => '',
//        'Дв.' => '',
//        'Ів.' => '',
//        'зв.' => '',
//        'Зб.' => '',
//        'тв.' => '',
//        'за.' => '',
//        'об.' => '',
//        'Липовоч.' => '',
//        'Слов’яносерощ.' => '',
//        'Brand.' => '',
//        'usit.' => '',
//        'Bönn.' => '',
//        'var.' => '',
//        'Pers.' => '',
//    ]);
//
//    $line = replace_2($line,[
//        'лекарств.' => '',
//        'Ніжен.' => '',
//        'металлич.' => '',
//        'классич.' => '',
//        'Бердичівщ.' => '',
//        'Хорол.' => '',
//        'Шенч.' => '',
//        'vulg.' => '',
//        'Канів.' => '',
//        'Тобілев.' => '',
//        'Васильк.' => '',
//        'Кролевечч.' => '',
//        'Козолеч.' => '',
//        'Gaertn.' => '',
//        'Moench.' => '',
//        'горизонт.' => '',
//        'приспособл.' => '',
//        'рыбацк.' => '',
//        'Куліш-Шексп.' => '',
//        'азб.' => '',
//        'К.' => '',
//        'Nilss.' => '',
//        'Shaw.' => '',
//        'Fitz.' => '',
//        'Pall.' => '',
//        'чересплечн.' => '',
//        'Вінничч.' => '',
//        'Валк.' => '',
//        'Брадлащ.' => '',
//        'коров.' => '',
//        'ароматн.' => '',
//        'Н.' => '',
//        'болезнен.' => '',
//        'Lamb.' => '',
//        'Car.' => '',
//        'All.' => '',
//        'Tull.' => '',
//        'Дубенщ.' => '',
//        'Spr.' => '',
//        'Max.' => '',
//    ]);
//
//    $line = replace_2($line,[
//        'немецк. сист.' => '',
//        'сист.' => '',
//        'немецк.' => '',
//        'Барвін.' => '',
//        'Дпіпропетр.' => '',
//        'Кревецьк.' => '',
//        'F.' => '',
//        'Roth.' => '',
//        'снисход.' => '',
//        'взрывч.' => '',
//        'пребыв.' => '',
//        'Bl.' => '',
//        'врем.' => '',
//        'Ким.' => '',
//        'герм.' => '',
//        'S.' => '',
//        'Vill.' => '',
//        'Tourn.' => '',
//        'Павлогр.' => '',
//        'взнузд. лошад.' => '',
//        'лошад.' => '',
//        'взнузд.' => '',
//        'гончарн' => '',
//        'винокур.' => '',
//        'взбалт.' => '',
//        'соединит.' => '',
//        'Latr.' => '',
//        'say.' => '',
//        'Crantz.' => '',
//        'Quel.' => '',
//        'Nordm.' => '',
//        'Kuhl.' => '',
//        'E. Geoffr.' => '',
//        'Geoffr.' => '',
//        'E.' => '',
//        'волокнист.' => '',
//        'Гудч.' => '',
//        'обыкнов.' => '',
//        'Прилуч.' => '',
//        'выдолбл.' => '',
//        'Нос.' => '',
//        'Біл.' => '',
//        'недвиж. имущ.' => '',
//        'имущ.' => '',
//        'недвиж.' => '',
//    ]);
//
//    $line = replace_2($line,[
//        'куда-л.' => '',
//        'назубриться.' => '',
//        'Морзч.' => '',
//        'Чорвоногр.' => '',
//        'стремит.' => '',
//        'каллигр.' => '',
//        'чём-л.' => '',
//        'Ковельщ.' => '',
//        'обр.' => '',
//        'Пісня.' => '',
//        'женск.' => '',
//        'Чорном.' => '',
//        'портн.' => '',
//        'Єл. Ум.' => '',
//        'Ум.' => '',
//        'Єл.' => '',
//        'причащ.' => '',
//        'многозначит.' => '',
//        'нарубл.' => '',
//        'Виробн.' => '',
//        'Василь.' => '',
//        'Кодюб.' => '',
//        'салотопл.' => '',
//        'сапожнич.' => '',
//        'Комун.' => '',
//        'Олекс.' => '',
//        'Галич.' => '',
//        'зрительн. впечатл.' => '',
//        'впечатл.' => '',
//        'зрительн.' => '',
//        'солевар.' => '',
//        'приблизит.' => '',
//        'R. Br.' => '',
//        'Br.' => '',
//        'R.' => '',
//        'чёмл.' => '',
//        '**-Лос.' => '',
//        'Лос.' => '',
//        'Крем.' => '',
//        'географ.' => '',
//        'Стебниц.' => '',
//        'Любеч.' => '',
//    ]);
//
//    $line = replace_2($line,[
//        'Бриж.' => '',
//        'Янов.' => '',
//        'Галуз.' => '',
//        'эллиптич.' => '',
//        '*Економічна наука*.' => '',
//        'украин.' => '',
//        'электрич.' => '',
//        'ЗОЮР II.' => '',
//        'Чернявськ.' => '',
//        '*Желеховский*.' => '',
//        'Карк.' => '',
//        '*Рідний Край*.' => '',
//        '*Гулак-Артемовський*.' => '',
//        'эвф.' => '',
//        'Свиди.' => '',
//        'Міющ.' => '',
//        'Крич.' => '',
//        'Дніпропетрівщ.' => '',
//        'Мінц.' => '',
//        'Borkh.' => '',
//        'Schreb.' => '',
//        'правоп.' => '',
//        'Черкес.' => '',
//        'Ставн.' => '',
//        'Мартинов.' => '',
//        'Вербицьк.' => '',
//        'Теол.' => '',
//        'Rchb.' => '',
//        'аллег.' => '',
//        'Ввч.' => '',
//        'перекл. А. Харч.' => '',
//        'Харч.' => '',
//        'А.' => '',
//        'перекл.' => '',
//        'звфем.' => '',
//        '*Савченко*.' => '',
//        'Güld.' => '',
//        '*Життя й Революція*.' => '',
//        'нем.' => '',
//        'взв.' => '',
//        'чемул.' => '',
//        'дл.' => '',
//    ]);
//
//    $line = replace_2($line,[
//        '**.' => '',
//        'В.' => '',
//        'отрицательн.' => '',
//        'Поділ.' => '',
//        'Свцдн.' => '',
//        'Могил.' => '',
//        'бран.' => '',
//        'старин.' => '',
//        'црк.' => '',
//        'Дорош.' => '',
//        'Кост.' => '',
//        'упраж.' => '',
//        'галиц.' => '',
//        'хозяйств.' => '',
//        'деревенск.' => '',
//        'завещ.' => '',
//        'утолщен.' => '',
//        'склон.' => '',
//        'школьн.' => '',
//        'неоднократ.' => '',
//        'несоверш.' => '',
//        'О. Пч.' => '',
//        'Пч.' => '',
//        'О.' => '',
//        'Чик.' => '',
//        'Ос.' => '',
//        'Г. Бав.' => '',
//        'Бав.' => '',
//        'Г.' => '',
//        '*собирательное*-пренебр.' => '',
//        'пренебр.' => '',
//        'продолж.' => '',
//        '*уменьшительная форма*-ласкат.' => '',
//        'ласкат.' => '',
//        'Кн.' => '',
//        'молюск.' => '',
//        'жидк.' => '',
//        'зет.' => '',
//        'угорс.' => '',
//        'сущест.' => '',
//        'пренеб.' => '',
//        'Грідч.' => '',
//        'госуд. должн.' => '',
//        'должн.' => '',
//        'госуд.' => '',
//    ]);
//
//    $line = replace_2($line,[
//        'жарг.' => '',
//        'безличн.' => '',
//        'зн.' => '',
//        'Сквир.' => '',
//        'Козел.' => '',
//        'употребл.' => '',
//        'сапож.' => '',
//        'подмывать.' => '',
//        'кем-л.' => '',
//        'Каменец.' => '',
//        'Тич.' => '',
//        'прилагат.' => '',
//        'Лубен.' => '',
//        'движ.' => '',
//        'восх.' => '',
//        'нисход.' => '',
//        'родств.' => '',
//        'униж.' => '',
//        'Филип.' => '',
//        'мануфакт.' => '',
//        'Д.' => '',
//        'свадебн.' => '',
//        'A.' => '',
//        'Jacq.' => '',
//        'фигур.' => '',
//        'Свадн.' => '',
//        'Кал.' => '',
//        'нарезан.' => '',
//        'Ніж.' => '',
//        'отт.' => '',
//        'сознательн. представл.' => '',
//        'представл.' => '',
//        'сознательн.' => '',
//        'удовлетвор. естеств. надобн.' => '',
//        'надобн.' => '',
//        'естеств.' => '',
//        'удовлетвор.' => '',
//    ]);
//
//    $line = replace_2($line,[
//        'почтит.' => '',
//        'Ромен.' => '',
//        'Уман.' => '',
//        'Кам’ян.' => '',
//        'Зміїв.' => '',
//        'черном.' => '',
//        'Коцюбин.' => '',
//        'небрежн. обращ.' => '',
//        'обращ.' => '',
//        'небрежн.' => '',
//        'Коцюбинськ.' => '',
//        'кач.' => '',
//        'самоуправл.' => '',
//        'дополнит.' => '',
//        'Пс.' => '',
//        'ЦН.' => '',
//        'всенародн.' => '',
//        'Самовид.' => '',
//        'Вінниц.' => '',
//        'Лис.' => '',
//        'Кух.' => '',
//        'самоуб.' => '',
//        'сумерк.' => '',
//        'буковин.' => '',
//        'Крм.' => '',
//        'однократ.' => '',
//        'образн.' => '',
//        'Васил.' => '',
//        'Ррінч.' => '',
//        'Свидв.' => '',
//        'шуточ.' => '',
//        'Пачовськ.' => '',
//        'Крол.' => '',
//        'предмет.' => '',
//        'чувствен. возбужд.' => '',
//        'возбужд.' => '',
//        'чувствен.' => '',
//        'Пр.' => '',
//        'климатич.' => '',
//        'Кам’янец.' => '',
//    ]);

    $line = replace_2($line,[
        'Пр.' => '',
        '**-Д.' => '',
        'Д' => '',
        'логич.' => '',
        'чего-н.' => '',
        'отрицат.' => '',
        'состоян.' => '',
        'электр.' => '',
        'Рудин.' => '',
        'Ніщ.' => '',
        'Самійлен' => '',
        'Кас.' => '',
        'Гринч. II.' => '',
        'Гринч.' => '',
        'Вахн.' => '',
        'кому-н. чего-н.' => '',
        'кому-н.' => '',
        'непереходн.' => '',
        'мжнож.' => '',
        'Козелец.' => '',
        'Шах.' => '',
        'Чек.' => '',
        'диалек.' => '',
        'П’ятигір.' => '',
        'Ніщинськ.' => '',
        '*Грінченко*-Григ.' => '',
        'Григ.' => '',
        'одн.' => '',
        'Пч.' => '',
        'Гатц.' => '',
        'Руч.' => '',
        'Псал.' => '',
        'Васальч.' => '',
        'Чубин.' => '',
        'стр.' => '',
        'Камен.' => '',
        'Кролев.' => '',
        '*Чубинський*.' => '',
        'метал.' => '',
        'З.' => '',
        'Верх.' => '',
        'Баштов.' => '',
        'Бардич.' => '',
        'Корольов.' => '',
        'Gärtn' => '',
        'Кухар.' => '',
        'Ніщин.' => '',
        'Сліс.' => '',
        'Анн.' => '',
        'окт.' => '',
    ]);

    return $line;
}

function replace_2($line, $data) {
    foreach ($data as $from => $to) {

        if (0 < mb_substr_count($line, ' '.$from)) {
            echo '+';
        }
        if (0 < mb_substr_count($line, '('.$from)) {
            echo '+';
        }
        if (0 < mb_substr_count($line, '['.$from)) {
            echo '+';
        }

        $line = str_ireplace(
            [' '.$from, '('.$from, '['.$from],
            [' *'.$to.'*', '(*'.$to.'*', '[*'.$to.'*']
            ,$line
        );

        if (0 < mb_substr_count($line, $from)) {
            var_dump($from);
        }
    }

    return $line;
}