<?php
// php cleaning_v6.php

require_once('../support/_require_once.php');

//$file = file_get_contents('cleaning/v.6-h.txt');
$file = file_get_contents('cleaning/v.7_p.txt');

$lines = explode("\n", $file);

$count = count($lines);

$resultText = '';
$resultTextS = '';
$resultTextH = '';

$sample = 25;

$counter = 0;

for ($i = 0; $i < $count+1; $i++) {

    $lineR = replacer($lines[$i]);

    $resultText .= $lineR . "\n";

    if (0 == $i % 1000) {
        echo $i.'.';
    }
}

echo date('H:i:s');

file_put_contents('cleaning/v.7_p.txt', $resultText);
//file_put_contents('cleaning/v.7-s.txt', $resultTextS);
//file_put_contents('cleaning/v.7-h.txt', $resultTextH);

function replacer($line)
{
//    $line = str_ireplace(
//        ['  '],
//        [' ']
//        ,$line
//    );
//
//    $line = str_ireplace(
//        ['  '],
//        [' ']
//        ,$line
//    );
//
//    $line = str_ireplace(
//        ['  '],
//        [' ']
//        ,$line
//    );
//    $line = str_ireplace(
//        [' межд. ', ' (межд.) ', ' межд.–', '(междом.)', ' междом. ', ' междом.)', ' междом.:'],
//        [' *вигук* ', ' (*вигук*) ', ' *вигук*-', '(*вигук*)', ' *вигук* ', ' *вигук*)' , ' *вигук*']
//        ,$line
//    );
//
//    $line = str_ireplace(
//        [' мест. ', ' мест.)', '(мест. ', ' мест.,', ' мест.:', '(мест.)'],
//        [' *займенник* ', ' *займенник*)', '(*займенник* ', ' *займенник*,', ' *займенник*:', '(*займенник*)']
//        ,$line
//    );
//
//    $line = str_ireplace(
//        [' сз. ',],
//        [' *сполучник* ',]
//        ,$line
//    );
//
//    $line = str_ireplace(
//        ['(АД.)', '(АД)', '(АД. ', '(АД '],
//        ['(*Б. Антоненко-Давидович*)', '(*Б. Антоненко-Давидович*)', '(*Б. Антоненко-Давидович* ', '(*Б. Антоненко-Давидович* ']
//        ,$line
//    );
//
//    $line = str_ireplace(
//        ['(Азб. комун.)', '(А. Любч.)', ' Ант.Давид.)', '(Б. Антон.-Давид.)', 'Безвірник 1930'],
//        ['(*Азбука комунізма*)', '(*Аркадій Любченко*)', ' *Антоненко-Давидови*ч)', '(*Антоненко-Давидови*ч)', '*Безвірник 1930*']
//        ,$line
//    );
//
//    $line = str_ireplace(
//        ['(Ант.-Драг.)', '(Ант.-Драг. ', '(Аф.-Чужб.-Шевч.)', '(Бажан)', '(Балтщ.)'],
//        ['(*Антоновичъ и Драгомановъ*)', '(*Антоновичъ и Драгомановъ* ', '(*Афанасьевъ Воспоминания о Шевченкѣ*)', '(*Бажан*)', '(*Балтщина*)']
//        ,$line
//    );
//
//    $line = str_ireplace(
//        ['(Бердич. ', '(Бердич.)', '(Бердянщ.)', 'Бібл.', 'Біл.-Нос.', 'Б.-Нос.'],
//        ['(*Бердичівщина* ', '(*Бердичівщина*)', '(*Бердянщина*)', '*Біблійний*', '*Білецький-Носенко*', '*Білецький-Носенко*']
//        ,$line
//    );
//
//    $line = str_ireplace(
//        ['Бонд. виробн.', 'Борз.', 'Борзенщ.', '(Боров.)', '(Боровик.)'],
//        ['*Бондарне виробництво*', '*Борзенщина*', '*Борзенщина*', '(*Боровиковський*)', '(*Боровиковський*)']
//        ,$line
//    );
//
//    $line = str_ireplace(
//        ['(Браун.)', '(Брацл.)', '(Брацлавщ.)', '(Буков.)', '«Буков.»'],
//        ['(*Браунер*)', '(*Брацлавщина*)', '(*Брацлавщина*)', '(*Буковина*)', '«*Буковина*»']
//        ,$line
//    );
//
//    $line = str_ireplace(
//        ['(Балк.)', '(Вас.)', '(Васильківщ.)', '(Васильч.)', '(В. Гжицьк.)', ' Васильч.)'],
//        ['(*Балківщина*)', '(*Б_Василенко*)', '(*Васильківщина*)', '(*Васильченко*)', '(*Гжицьк*)', ' *Васильченко*)']
//        ,$line
//    );
//
//    $line = str_ireplace(
//        ['(Верхнедн.)', '(Верхр.)', 'Вес. пісня', '(Вин.)', '(Винн.)', '(Виннич.)', '(Верхнедн.', '(Верхр.,'],
//        ['(*Верхнедніпрівщина*)', '(*Верхратський*)', '*весільна пісня*', '(*Винниченко*)', '(*Винниченко*)', '(*Винниченко*)', '(*Верхнедніпрівщина* ', '(*Верхратський*,',]
//        ,$line
//    );
//
//    $line = str_ireplace(
//        ['Віннич.', '«Вісті»', '(Влизько)', 'Вовч.', 'Вовчанщ.', 'Волч.', '(Ворон.)', '(Вісті)', ' Ворон.)'],
//        ['*Вінниччина*', '«*Вісті*»', '(*Влизько*)', '*Вовчанщина*', '*Вовчанщина*', '*Волчанськ*', '(*Вороніжчина*)', '(«*Вісті*»)', ' *Вороніжчина*)']
//        ,$line
//    );
//
//    $line = str_ireplace(
//        ['В. Підм.', 'В. Підмог.', '(Вх.)', '(Вхр.)', 'Гайсин.', 'Гайсинщ.'],
//        ['*Підмогильний*', '*Підмогильний*', '(*Верхратський*)', '(*Верхратський*)', '*Гайсинщина*', '*Гайсинщина*']
//        ,$line
//    );
//
//    $line = str_ireplace(
//        ['Г. Барв.', 'Г. Велз', 'Г. Думка', 'Гр. Думка', '(Барв.)', '(Велз)'],
//        ['*Г_Барвінок*', '*Велз*', '*Громадська Думка*', '*Громадська Думка*', '(*Г_Барвінок*)', '(*Велз*)']
//        ,$line
//    );
//
//    $line = str_ireplace(
//        ['Герин.', 'Гнід.', 'Гол.', 'Голов.', 'Головац.', 'Гліб.'],
//        ['*Геринович*', '*Гнѣдичъ*', '*Головацкій*', '*Головацкій*', '*Головацкій*', '*Глібів*']
//        ,$line
//    );
//
//    $line = str_ireplace(
//        ['Голов.', 'Г. Григор.', 'Григор.', 'Гр.', 'Грін.', 'Грінч.', 'Греб.'],
//        ['*Головацький*', '*Григоренко*', '*Григоренко*', '*Грінченко*', '*Грінченко*', '*Грінченко*', '*Гребінка*']
//        ,$line
//    );
//
//    $line = str_ireplace(
//        ['Гул.-Артем', 'Гул.-Арт.', 'Гуманщ.', 'Ґерин.', 'Ґ. Шкур.', '(Дещо)', 'Дит. пісня'],
//        ['*Гулак-Артемовський*', '*Гулак-Артемовський*', '*Гуманщина*', '*Ґеринович*', '*Шкурупій*', '(*Дещо*)', '*дитяча пісня*']
//        ,$line
//    );
//
//    $line = str_ireplace(
//        ['Дм. Марков.', 'Дніпропетр.', 'Дніпр. Ч.', 'Дн. Ч.', 'Дн. Чайка', 'Дніпр. Чайка', 'Добровольськ.', 'Д. Марков.', '*Дніпрова Чайка', 'Дм.  Марков.'],
//        ['*Маркович*', '*Дніпропетровщина*', '*Дніпрова Чайка', '*Дніпрова Чайка', '*Дніпрова Чайка', '*Дніпрова Чайка', '*Добровольський*', '*Маркович*', '*Дніпрова Чайка*', '*Маркович*',]
//        ,$line
//    );
//
//    $line = str_ireplace(
//        ['(Марков.)', 'Дом.', 'Доман.', 'Дорошкев.', 'Драг.', 'Драгом.', 'Драг. Пр.', 'Драг. Пред.', 'Едґ. По'],
//        ['(*Маркович*)', '*Доманицький*', '*Доманицький*', '*Дорошкевич*', '*Драгоманов*', '*Драгоманов*', '*Драгоманов*', '*Драгоманов*', '*Едґард Аллан По*']
//        ,$line
//    );
//
//    $line = str_ireplace(
//        ['Еварн.', 'Еккл.', 'Екклез.', 'Ек. Наука', 'Екон. Наука', 'Економ. Н.', 'В. Еллан.', 'Екон. наука', 'Економ. Наука'],
//        ['*Еварницький*', '*Екклезіяст*', '*Екклезіяст*', '*Економічна наука*', '*Економічна наука*', '*Економічна наука*', '*Еллан*', '*Економічна наука*', '*Економічна наука*']
//        ,$line
//    );
//
//    $line = str_ireplace(
//        ['Етн. Зб.', '*Єванг.*', 'Єванг.', 'Єв. Луки', 'Єв. Морач.', 'Етн. Збірн.', 'Єв. Л.', 'Єв. Мт.', '(Єв.)'],
//        ['*«Етнографічний Збірник*','Євангеліє Луки', '*Євангеліє*', '*Євангеліє Луки*', '*Євангеліє*', '*«Етнографічний Збірник*','*Євангеліє Луки*', '*Євангеліє Матвія*', '(*Євангеліє*)']
//        ,$line
//    );
//
//    $line = str_ireplace(
//        ['Єв. Мат.',            'Єв. Мр.',      'Єв. Мор.',  'Єв. Морач.', 'Єв. І.', '(Єв.,'],
//        ['*Євангеліє Матвія*', '*Євангеліє*', '*Євангеліє*', '*Євангеліє*', '*Євангеліє*', '(*Євангеліє*,']
//        ,$line
//    );
//
//    $line = str_ireplace(
//        ['Єфр.', 'Жарт. пісня', 'Сл. Жел.', 'Сл. Желех', 'Житом.', 'Ж. й р', '(Желех.)', '(Жел.)', 'Жел.)'],
//        ['*Єфремов*', '*жартівлива пісня*', '*Желеховский*', '*Желеховский*', '*Житомирщина*', '*Життя й Революція*', '(*Желеховский*)', '(*Желеховский*)', '(*Желеховский*)']
//        ,$line
//    );
//
//    $line = str_ireplace(
//        ['Загір.', 'Закр.', 'Звин.', 'Звиног.', 'Звяг.', 'Звягельщ'],
//        ['*Загірня*', '*Закревскій*', '*Звиногородщина*', '*Звиногородщина*', '*Звягельщина*', '*Звягельщина*']
//        ,$line
//    );
//
//    $line = str_ireplace(
//        ['Зіньківщ.', '**Звягельщина*ина*', '*Звягельщина*.', 'Зміїв. п.', 'Зміївщ.', 'Золотон.', 'ЗОЮР.', 'Івч.', '*Дніпрова Чайка**'],
//        ['*Зіньківщина*', '*Звягельщина*', '*Звягельщина*', '*Зміївський повіт*', '*Зміївщина*', '*Золотонощина*', 'ЗОЮР', '*Івченко*', '*Дніпрова Чайка*']
//        ,$line
//    );
//
//    $line = str_ireplace(
//        ['Іпат. літ.', 'Калит.', 'Каменечч.', 'Кам’янеч.', 'Кам. п.', 'Кам’ян. п.', 'Канівщ.'],
//        ['*Іпатський літопис*', '*Калитовський*', '*Кам’янеччина*', '*Кам’янеччина*', '*Кам’янецький повіт*', '*Кам’янецький повіт*', '*Канівщина*']
//        ,$line
//    );
//
//    $line = str_ireplace(
//        ['Катериносл.', '(Квітка.)', '(Кв.)', '(Квіт.)', 'Київщ.', '(Кирил.)','Кв.-Осн.', '(Осн.)', '(Квітка-Осн.)', '(Осн. '],
//        ['*Дніпропетрівщина*', '(*Квітка*)', '(*Квітка*)', '(*Квітка*)', '*Київщина*', '*Кириленко*', '*Квітка*', '*Квітка*', '*Квітка*', '(*Квітка* ']
//        ,$line
//    );
//
//    $line = str_ireplace(
//        ['(Клин.)', 'Кобел.', 'Кобеляч.', 'Козелеч.',                        '(Kolb.)'],
//        ['(*Клиновецька*)', '*Кобеляччина*', '*Кобеляччина*', '*Козелеччина*', '']
//        ,$line
//    );
//
//    $line = str_ireplace(
//        ['Ком.',      '(Комар.)', 'Конгр.', 'Кон.'                        , 'Конис.', 'Кониськ.',            'Конотіпщ.', 'Конот. п.'],
//        ['*Комаров*','(*Комаров*)', '*Константиноградщина*', '*Кониський*',  '*Кониський*',  '*Кониський*', '*Конотіпщина*', '*Конотопський повіт*']
//        ,$line
//    );
//
//    $line = str_ireplace(
//        ['Корол.', 'Корост.'            , 'Костом.', 'Костомар.', 'Котл.', 'Котляр.'                        , 'Коц.'            , 'Коцюб.'],
//        ['*Короленко*', '*Коростенщина*', '*Костомаров*', '*Костомаров*', '*Котляревський*', '*Котляревський*', '*Коцюбинський*', '*Коцюбинський*']
//        ,$line
//    );
//
//    $line = str_ireplace(
//        ['Кременеч.', 'Кременч.', 'Кременчуч.',                'Кр.', 'Крим.', 'Кримськ.'],
//        ['*Кременеччина*', '*Кременчуччина*', '*Кременчуччина*', '*Кримський*', '*Кримський*', '*Кримський*']
//        ,$line
////    );
//
//    $line = str_ireplace(
//        ['Кролевеч.', 'Кропивн.', 'К. Ст.'                       , 'Е. Стар.', 'К. Старина',                   'Кул.', 'Купал. пісня', 'К. Стар.', '(Стар.)'],
//        ['*Кролевеччина*', '*Кропивницький*', '*Кіевская Старина*', '*Кіевская Старина*', '*Кіевская Старина*', 'Куліш', '*Купалова пісня*', '*Кіевская Старина*', '(*Кіевская Старина*)']
//        ,$line
//    );
//
//    $line = str_ireplace(
//        ['Купал. пісня', 'Лавр.', 'Лебед.', 'Лебедин.', 'Лебединщ.'                         , 'Лепк.', 'Леся Укр.', 'Л. Укр.'],
//        ['*Купалова пісня*)', '*Лавренко*', '*Лебединщина*', '*Лебединщина*', '*Лебединщина*', '*Лепкий*', '*Леся Українка*', '*Леся Українка*']
//        ,$line
//    );
//
//    $line = str_ireplace(
//        ['Леонт.', 'Липовеч.', 'Липов. п.'                    ,'Лобод.',       'Лохв.', 'Лохвич.', 'Луб.', 'Лубенщ.'],
//        ['*Леонтович*', '*Липовеччина*', '*Липовецький повіт*', 'Лободовський', '*Лохвиччина*', '*Лохвиччина*', '*Лубенщина*', '*Лубенщина*']
//        ,$line
//    );
//
//    $line = str_ireplace(
//        ['Лукаш.', 'Люб.',          'Макар.', 'Макаров.', 'Маков.', 'Макс.', 'Манж.'],
//        ['*Лукашевичъ*', '*Любченко*', '*Макаровський*', '*Макаровський*', '*Маковей*', '*Максимович*', '*Манжура*']
//        ,$line
//    );
//
//    $line = str_ireplace(
//        ['Марк.', 'Маркев.',          'Марко В.', 'М. Вовч.', 'М. В.', 'Март.', 'Мартин.', 'Мат. Сл'],
//        ['*Маркевичъ*', '*Маркевичъ*', '*Марко Вовчок*', '*Марко Вовчок*', '*Марко Вовчок*', 'Мартинович', 'Мартинович', '*Словник математичної термінології*']
//        ,$line
//    );
//
//    $line = str_ireplace(
//        ['Мат. Укр. Етн.', 'М. Ворон.',                      'М. Грінч.', 'Мед. слов.', 'Мет.', 'Метл.', 'М. Зер.', 'Мат. укр. Етн. I'],
//        ['*Матеріали до української етнольоґії*', '*Вороний*', '*Грінченкова*', '*Медичний словник*', '*Метлинський*', '*Метлинський*', '*Зеров*', '*Матеріали до української етнольоґії*']
//        ,$line
//    );
//
//    $line = str_ireplace(
//        ['Мед. Сл.', 'Микит.', 'Мил.', 'Милор.', 'Милорад.' , 'Мирг.', 'Миргор.', 'Миргородщ.', 'Мир.', 'Мирн.'],
//        ['*Медичний словник*', '*Микитенко*', '*Милорадович*', '*Милорадович*', '*Милорадович*', '*Миргородщина*', '*Миргородщина*', '*Миргородщина*', '*Мирний*', '*Мирний*']
//        ,$line
//    );
//
//    $line = str_ireplace(
//        ['(Мирний.)', 'Михайлич.'   , 'Міуськ.', 'Міущ.', 'Міюс.', 'М. Калин.', 'М. Костом.', 'Мкр.'],
//        ['*Мирний*', '*Михайличенко*', '*Міющина*', '*Міющина*', '*Міющина*', '*Калинович*', '*Костомаров*', '*Макаровський* ']
//        ,$line
//    );
//
//    $line = str_ireplace(
//        ['Міуськ.', 'Міущ.', 'Міюс.', 'М. Калин.', 'М. Костом.', 'Мкр.', 'Млак.'                        , 'М. Лев.', 'М. Левиц.'],
//        ['*Міющина*', '*Міющина*', '*Міющина*', '*Калинович*', '*Костомаров*', '*Макаровський*', '*Млака*','*Левицький*','*Левицький*']
//        ,$line
//    );
//
//    $line = str_ireplace(
//        ['Млр. лит. сб.', 'М. Макар.', 'Мнж.',                               'Могилівщ.', 'Морач.', 'Морд.', 'Мордов.'],
//        ['*Малорусскій литературный сборникъ*', '*Макаровський*', '*Манжура*', '*Могилівщина*', '*Євангеліє*', '*Мордовцев*', '*Мордовцев*']
//        ,$line
//    );
//
//    $line = str_ireplace(
//        ['М. Сем.', 'М. Скрипн.', 'М. Стариц.', 'М. Хвильов.', 'Навроцьк.', 'Н.-Вол. п.', 'Стариц.', 'Хвильов.', 'Н.Вол. п.', 'Н. Вол.', 'Вол. г.'],
//        ['*Семенко*','*Скрипник*','*Старицький*','*Хвильовий*','*Навроцький*','*Новгород-Волинський повіт*','*Старицький*','*Хвильовий*','*Новгород-Волинський повіт*','*Новгород-Волинський повіт*','*Новгород-Волинський повіт*']
//        ,$line
//    );
//
//    $line = str_ireplace(
//        ['Н. Громада', 'Неч.-Лев.', 'Н.-Л.', 'Н.-Лев.','Ніженщ.', 'Ніков.', 'Ніс.','Неч.Лев.'],
//        ['*Нова Громада*','*Нечуй-Левицький*','*Нечуй-Левицький*','*Нечуй-Левицький*','*Ніженщина*', '*Ніковський*', '*О народной медицинѣ южнороссовъ*','*Нечуй-Левицький*']
//        ,$line
//    );
//
//    $line = str_ireplace(
//        ['Н.-Неч.', 'Неч. Лев.', 'Новомоск.', 'Новомосковщ.', 'Ном.', 'Номис.'],
//        ['*Нечуй-Левицький*', '*Нечуй-Левицький*', '*Новомосковщина*', '*Новомосковщина*', '*Номис*', '*Номис*']
//        ,$line
//    );
//
//    $line = str_ireplace(
//        ['Н. Рада', 'Огон.', 'Одещ.', 'О. Лев.','Ор. Лев.','Ор. Левиц.','Олександр.','Олександрівщ.','Лев.','Левиц.'],
//        ['*Нова Рада*','*Огоновський*','*Одещина*','*Орест Левицький*','*Орест Левицький*','*Орест Левицький*','*Олександрівщина*','*Олександрівщина*','*Орест Левицький*','*Орест Левицький*']
//        ,$line
//    );
//
//    $line = str_ireplace(
//        ['Олм. Примха', 'О. Пчілка', 'Ол. Пчілка.', 'Остерщ.', 'Остр. Скарбів','О. 1862.','Павл.', 'Олм. Примха', 'Ол. Пчілка'],
//        ['*Олмейрова Примха*', '*Олена Пчілка*', '*Олена Пчілка*', '*Остерщина*', '*Острів Скарбів*', '*Основа*','*Павловський*','*Олмейрова Примха*', '*Олена Пчілка*']
//        ,$line
//    );
//
//    $line = str_ireplace(
//        ['Пачов.', 'Переясл.', 'Переяславщ.','Пирят.','Пирятинщ.','Под.','Под. губ.'],
//        ['*Пачовський*','*Переяславщина*','*Переяславщина*','*Пирятинщина*','*Пирятинщина*','*Поділля*','*Подільська губ*']
//        ,$line
//    );
//
//    $line = str_ireplace(
//        ['Полт.', 'Потеб.','Пот. Одис.', 'Правн. Сл.', 'Прик.','Проскур.','Пот.'],
//        ['*Полтавщина*','*Потебня*','*Потебня Одиссея*','*Російсько-український словник правничої мови*', '*приказка*','*Проскурівна*','*Потебня*']
//        ,$line
//    );
//
//    $line = str_ireplace(
//        ['Проскурівщ.', 'Проскур. Уляся','Пр. Правда','Пролет. Пр.','П. Филип.','(Рада.)'],
//        ['*Проскурівщина*', '*Проскурівна*','*Пролетарська Правда*','*Пролетарська Правда*','*Филипович*','(*Рада*)']
//        ,$line
//    );
//
//    $line = str_ireplace(
//        ['Радом.', 'Радомищ.','Раєвськ.','Ржищівщ.','Рильськ.','Р. Край','Роменщ.'],
//        ['*Радомищина*','*Радомищина*','*Раєвський*','*Ржищівщина*','*Рильський*','*Рідний Край*','*Роменщина*']
//        ,$line
//    );
//
//    $line = str_ireplace(
//        ['Ж. й Р.', 'Н. Р.', 'Руд.', 'Рудан.', 'Рудч.','Самійл.', '(Сам.)'],
//        [' ', ' ', '*Руданський*', '*Руданський*', '*Рудченко*','*Самійленко*', '(*Самійленко*)']
//        ,$line
//    );
//
//    $line = str_ireplace(
//        ['Свидн.', 'Свидниц.', 'Св. Л.', 'Св. П.', 'Св. Пис.', 'Сим.', 'Сім.', 'Сімович', 'Св. Письмо', 'знаток Св. Писания'],
//        ['*Свидницький*','*Свидницький*','*Свидницький','*Святе Письмо*','*Святе Письмо*','*Симонов*','*Сімович*','*Сімович*','*Святе Письмо*','*Святе Письмо*']
//        ,$line
//    );
//
//    $line = str_ireplace(
//        ['Сквир. у.', 'Сквирщ.','Сл. Аф.','Сл. Гр.','Сл. Грінч.','Сл. Йог.','Сл. Левч.','Слов’яносербщ.'],
//        ['*Сквирський*','*Сквирщина*','*Афанасьевъ*','*Грінченко*','*Грінченко*','*Йогансен*','*Левченко*','Слов’яносербщина']
//        ,$line
//    );
//
//    $line = str_ireplace(
//        ['Сл. пр. м.', 'Сл. правн. м.'],
//        ['*Російсько-український словник правничої мови*','*Російсько-український словник правничої мови*']
//        ,$line
//    );
//
//    $line = str_ireplace(
//        ['Сл. Ум.', 'Сл. хем. терм.','Сл. Шейк.', 'Сл. Яв.','С. Оран.'],
//        ['*Уманець*', '*Словник хемічної термінології*', '*Опыть южнорусскаго словаря*', '*Яворницького*','*Оранський*']
//        ,$line
//    );
//
//    $line = str_ireplace(
//        ['Сл. *Грінченко*','Сл. Яворн.', 'Сл. Афан.', 'Геол. Сл.','Сл. Дубр.','Сл. Уман.', '(Шейк.)','К. С.','. С. З.'],
//        ['*Грінченко*','*Яворницького*', '*Афанасьевъ*', '*Геологічний*','*Дубровського*','*Уманського*','*Шейковскій*','','']
//        ,$line
//    );
//
//    $line = str_ireplace(
//        ['Сосн.','Стариц.','Старобільщ.','Стар.-Чернях.','Стат. Ак. Н.','Статут Ак. Наук'],
//        ['*Сосницький район*','*Старицький*','*Старобільщина*','*Старицька-Черняхівська*','*Статут Української Академії Наук*','*Статут Української Академії Наук*']
//        ,$line
//    );
//
//    $line = str_ireplace(
//        ['Стар.-Черн.','Стат. Ак. Наук', 'Ст. Ак. Н.','Стар.-Черних.', 'М. Стар.)'],
//        ['*Старицька-Черняхівська*','*Статут Української Академії Наук*','*Статут Української Академії Наук*','*Старицька-Черняхівська*', '']
//        ,$line
//    );
//
//    $line = str_ireplace(
//        ['Стат. Лит.','Ст. Лит.','Стебн.','Степ.','Стеф.','Стор.','Сторож.'],
//        ['*Статут Литовський*','*Статут Литовський*','*Стебницький*','*Степовик*','*Стефаник*','*Стороженко*','*Стороженко*']
//        ,$line
//    );
//
//    $line = str_ireplace(
//        ['Лит. Статут','Статут Лит.','(Стат. Акад. Наук)','(Стат. Акад.)'],
//        ['*Статут Литовський*','*Статут Литовський*','','']
//        ,$line
//    );
//
//    $line = str_ireplace(
//        ['Ст. Савч.', 'Сумщ.','Терещ.','Тесл.','Тоб.','Тобіл.','Троян.','(Ст. УАН)','(Ст. А. Н.)'],
//        ['*Савченко*','*Сумщина*','*Терещенко*','*Тесленко*','*Тобілевич*','*Тобілевич*','*Трояновський*','','']
//        ,$line
//    );
//
//    $line = str_ireplace(
//        ['Тульч.','Тульчинщ.','Тур.','Тур. Охор. роб.','Тутк.','Урядж. Лабор.','Федьк.','Філян.', '(Франко. Пр.)', ' Охор. роб.'],
//        ['*Тульчинщина*','*Тульчинщина*','*Турченко*','*Турченко*','*Тутківськкй*','','*Федькович*','Філянський','', '']
//        ,$line
//    );
//
//    $line = str_ireplace(
//        ['Франко.', 'Фр.', 'Фран.','Харк. Зб.','Харк. Збірн.','Харьк. Сб.','(Харк. п.)'],
//        ['*Франко*','*Франко*','*Франко*','*Харьковскій Сборникъ*','*Харьковскій Сборникъ*','*Харьковскій Сборникъ*','']
//        ,$line
//    );
//
//    $line = str_ireplace(
//        ['Харк.', 'Харківщ.','Хвед. б.','Хведор.','Хведор. Зб.', 'Хвед. Зб.','Хвед.'],
//        ['*Харківщина*', '*Харківщина*','*Хведоровычъ*','*Хведоровычъ*','*Хведоровычъ*','*Хведоровычъ*','*Хведоровычъ*']
//        ,$line
//    );
//
//    $line = str_ireplace(
//        ['Херс.','Херсонщ.','Хорольщ.','Хор. п.','Хотин. п.','Хотинщ.'],
//        ['*Херсонщина*','*Херсонщина*','*Хорольщина*','*Хорольський*'.'*Хотинський*','*Хотинщина*']
//        ,$line
//    );
//
//    $line = str_ireplace(
//        ['Червоногр.','Черкащ.','Черк.','Черкас.','Черніг.','Черн.','Черняв.'],
//        ['*Червоноградщина*','*Черкащина*','*Черкасенко*','*Черкасенко*','*Чернігівщина*','*Чернявський*','*Чернявський*']
//        ,$line
//    );
//
//    $line = str_ireplace(
//        ['Чуб. III', 'Чуб. II', 'Чуб. I', 'Чуб. V', 'Чуб. VII', 'Чуб. VI'],
//        'Чуб.'
//        ,$line
//    );
//
//    $line = str_ireplace(
//        ['Чигир.', 'Чигиринщ.', 'Чорномор.', 'Чуб.', 'Чупр.'],
//        ['*Чигиринщина*', '*Чигиринщина*', '*Чорномор’я*', '*Чубинський*', '*Чупринка*']
//        ,$line
//    );
//
//    $line = str_ireplace(
//        ['Шахм.', 'Шахмат.', 'Шашк.', 'Шевч.', 'Шевчен.', 'Шейк.','Шух.','Щог.','Щогол.','Яворн.','Яворськ.','Я. Савч'],
//        ['*Шахматов*','*Шахматов*','*Шашкевич*','*Шевченко*','*Шевченко*','','*Шухевич*','*Щоголів*','*Щоголів*','*Яворницький*','*Яворскій*','*Савченко*']
//        ,$line
//    );
//
//    $line = str_ireplace(
//        ['авиац.','агрон.', 'анат.','антроп.','аптек.','араб.'],
//        ['*авиационный*','агрономический*','*анатомический*','*антропологический*','*аптекарский*','арабское слово']
//        ,$line
//    );
//
//    $line = str_ireplace(
//        ['ариф.','арифм.','арабское слово','арх.','архаич.'],
//        ['*арифметический*','*арифметический*','*арабское слово*','*архаическое слово*','*архаическое слово*']
//        ,$line
//    );
//
//    $line = str_ireplace(
//        ['археол.','архит.','астр.','астрон.','б. вр.','безл.','биол.'],
//        ['*археологический*','*архитектурный*','*астрономический*','*астрономический*','*майбутній час*','*безособовий*','биологический']
//        ,$line
//    );
//
//    $line = str_ireplace(
//        ['бот.','биологический','букв.','б. употреб. мн.','бухг.','сов.','сов. в.'],
//        ['*ботанический*','*биологический*','*буквально*','*більш вживане у множині*','*бухгалтерский*','*доконаний вид*','*доконаний вид*']
//        ,$line
////    );
//
//    $line = str_ireplace(
//        ['(в.',' в. ', '(созв. '],
//        ['(вид',' *вид* ', '(созвездие ']
//        ,$line
//    );
//
//    $line = str_ireplace(
//        ['варв.','(вежл.', 'вес. пісня', 'ветер.','взаим.','вин. п.'],
//        ['*варваризм*','(*вежливо* ','*весільна пісня*','*ветеринарный*','*взаимный залог*','*винительный падеж*']
//        ,$line
//    );
//
//    $line = str_ireplace(
//        [' воен. ',' военн. ',' возвр. з.', 'возвр. ', ' возвыш. ','(воен. ', '(воен.)', '(военн.)'],
//        [' *военный термин* ',' *военный термин* ', ' *возвратный залог* ', ' *возвратный залог* ', ' *возвышенно* ', '(военный ', '(*военный*)', '(*военный*)']
//        ,$line
//    );
//
//    $line = str_ireplace(
//        [' воен.,', ' воен.)', 'во мн. местах', 'вост.', 'в перен. знач.'],
//        [' *военный термин*,',' *военный термин*)', 'во многих местах', '*восточное слово*', 'в переносном значении']
//        ,$line
//    );
//
//    $line = str_ireplace(
//        ['в прям. и перен. знач.',         'в перен. смысле',    ' перен. знач.',         ' перен.', '(перен.)'],
//        ['в прямом и переносном значении','в переносном смысле', ' переносное значение', ' переносно', '(*переносно*)']
//        ,$line
//    );

    $line = str_ireplace(
        ['в прям. и перен. знач.',         'в перен. смысле',    ' перен. знач.',         ' перен.', '(перен.)'],
        ['в прямом и переносном значении','в переносном смысле', ' переносное значение', ' переносно', '(*переносно*)']
        ,$line
    );

    return $line;
}